[
  "Knowledge Base",
  "STATE LOGINS",
  "PRINT/SCAN",
  "MISC REJECTIONS",
  "MAIN REJECTIONS",
  "COGS",
  "GENERAL SCRIPTS",
  "Queue",
  "Queue",
  "",
  "Main 236",
  "Order",
  "Type of issue",
  "Issue",
  "Script",
  "Additional",
  "information",
  "request Address",
  "Company Address to IL state allows no more than 45 characters for the Company Address.",
  "long",
  "Please abbreviate as necessary.",
  "IL",
  "Address cannot be a",
  "PoBox or Pmb",
  "AL",
  "AR",
  "CA",
  "CO",
  "CT",
  "FL",
  "The state does not accept PO Box for principal company address.",
  "Please provide a physical street address.",
  "Colum STATE",
  "VA",
  "NC",
  "ID",
  "IA",
  "OK",
  "IN",
  "LA",
  "MT",
  "NH",
  "RI",
  "VT",
  "TN",
  "UT",
  "MA",
  "NE",
  "Address PoBox or",
  "Pmb",
  "We need a street name in the address, since the state does not allow",
  "just the box number. Please change it so we can continue with the",
  "filing. Thank you.",
  "MO",
  "Address cannot be",
  "validate",
  "We cannot validate the address entered, check the entered address for",
  "accuracy. If the address entered is correct, please contact the Clerk's",
  "Office at 804-371-9733 or 1-866-722-2551, sccefile@scc.virginia.gov",
  "for more information and let us know how to proceed.",
  "The State doesn't allow PM Boxes as a company address. You could",
  "remove “_____\" from the company address to proceed with the same",
  "address, or you can provide a new street address.",
  "Show 1 more",
  "Invalid Address as",
  "Principal Address",
  "Please be advised that the address “_______” can be rejected by the",
  "State as is an Invalid Address to use for many companies. Please",
  "provide a new Company address to proceed.",
  "WY",
  "Pobox or mailing",
  "center",
  "The State does not allow P.O. Box, PMB, Shipping Centers, or UPS",
  "Stores as the Company address.",
  "AK",
  "Unfortunately the State Address Verification didn't validate the",
  "address. We will need a new address to proceed with the online filing.",
  "Thank you.",
  "OR",
  "International",
  "Address not allowed",
  "The state does not accept an International address. Please provide an",
  "address inside the United States.",
  "RA Address as",
  "Company address",
  "Our Registered Agent address can't be used as the Company address,",
  "if you want to use our Virtual Address Service you can subscribe to",
  "our Service at https://bizee.com/form/virtual-mailbox otherwise",
  "provide us with a new company address. Thank you.",
  "GENERAL",
  "Address Is",
  "Incorrect/Doesn't",
  "Exist",
  "The street address you provided is incorrect or does not exist. Please",
  "give us a new address so we can continue with the filing. Thank you.",
  "AZ",
  "WA",
  "SC",
  "request Member/Director/",
  "Officer",
  "Our virtual address",
  "Service",
  "The company address is from our virtual address which is not included",
  "in your package, if you want to use our Virtual Address please add it to",
  "your package in our website, otherwise please provide a new address.",
  "Thank you",
  "Company Address",
  "cannot be the same",
  "as the Commercial",
  "RA address",
  "If the Agent is a Commercial Registered Agent, the address of the",
  "company and/or member can not be the same as the Registered",
  "Agent. Please provide a new address.",
  "Quadrant Missing for",
  "DC address",
  "According to the USPS the address you entered is missing important",
  "information, please provide the quadrant (N, S, E,W). Please enter the",
  "missing information to continue. Thank you.",
  "DC",
  "Missing Info On",
  "Address",
  "secondary information such as an Apartment or Suite. Please enter",
  "the missing information to continue. Thank you.",
  "request Registered Agent",
  "ZIP Code doesn’t",
  "match",
  "USPS shows that your correct ZIP Code is \"______\" Please verify it, and",
  "let us know how you would like to submit it.",
  "City doesn’t match",
  "USPS shows that your correct City is \"______\" Please verify it, and let us",
  "know how you would like to submit it.",
  "Suggest an Address",
  "The state is not recognizing the company address you entered. Please",
  "confirm if you would like to use the suggested address so we can",
  "proceed with your request. Thank you. This is the address suggested:",
  "__________",
  "Address Not Verified",
  "On USPS",
  "The Address cannot be verified with the USPS database. Please",
  "recheck the street address, city and zip code to proceed with your",
  "Physical Address",
  "Required",
  "The Address must be a physical deliverable address and cannot be a",
  "PMB, PO Box, UPS, FEDEX, STAPLES, postal, shipping or mailing",
  "center. Please send us a physical address for your company so we can",
  "continue with the filing. Thank you.",
  "The address must be a physical deliverable address and cannot be a",
  "center, VIRTUAL OFFICE ADDRESS. Please send us a physical address",
  "for your company so we can continue with the filing. Thank you.",
  "VA service from",
  "another Company",
  "Please be advised that the virtual address provided, (VIRTUAL",
  "ADDRESS), can only be used for the company (CORRESPONDING",
  "COMPANY) and not for this company, (THIS COMPANY). You may",
  "provide an address for this business name filing or you now have the",
  "option to order a virtual address for this company using the link,",
  "https://bizee.com/form/virtual-mailbox. Please advise how you would",
  "like to proceed. Thank you.",
  "Entity as Member",
  "not in State",
  "Companies from other states are not allowed, only those active in",
  "______. Please change it to another company within the state or an",
  "individual so we can proceed with the filing. Thank you.",
  "Please be advised that the State of Indiana doesn't allow an entity as",
  "a member. Please provide an individual information to proceed.",
  "Entity as Manager",
  "Please be advised that the State of Rhode Island doesn't allow an",
  "entity as a manager. Please provide an individual information to",
  "proceed.",
  "Member must be",
  "Active in State if",
  "using in State",
  "address",
  "Please be advised that if an Entity has a ____ address, it must be Active",
  "within the ____ State. If the company is registered in another State,",
  "please provide a different address for this Entity, to avoid a rejection",
  "from the State",
  "PA",
  "Director First Name",
  "to long",
  "FL state allows no more than 14 characters for the Director’s first name.",
  "Please remove the middle name or abbreviate it for ______.",
  "Director Last Name",
  "FL state allows no more than 20 characters for the Director’s last name.",
  "Please abbreviate it for ______.",
  "MD",
  "Pending Issue",
  "Officer First Name to",
  "FL state allows no more than 14 characters for the Officer’s first name.",
  "Officer Last Name to",
  "FL state allows no more than 20 characters for the Officer’s last name.",
  "Member First Name",
  "FL state allows no more than 14 characters for the Member’s first",
  "name. Please remove the middle name or abbreviate it for ______.",
  "Member Last Name",
  "FL state allows no more than 20 characters for the Member’s last",
  "name. Please abbreviate it for ______.",
  "Name Reservation,",
  "Owner doesn’t",
  "Dear client, the state will reject filing since the name and address of",
  "the officer that filed for the reservation must MATCH EXACTLY.",
  "Please, If you want the name you reserve, provide the full member's",
  "name and correct member's address. Thank you.",
  "Member’s name to",
  "NJ state allows no more than 70 characters for the Member’s name.",
  "NJ",
  "Duplicate Member,",
  "Suffix",
  "It seems you added a new member with the same name, if she/he is a",
  "different person please add \"JUNIOR\", \"SENIOR\", \"II\", so she/he can be",
  "distinguishable.",
  "The state does not accept PO Box for member’s address. Please",
  "provide a physical street address.",
  "Company Cannot",
  "Act As Its Own",
  "Member",
  "A company cannot act as its own MEMBER, please provide an Active",
  "entity information or an individual's information instead to proceed with",
  "your filing. Thank you.",
  "Company As",
  "Member Not Found",
  "We haven't been able to find _________ as active in the __ SOS. Please",
  "provide an active entity's information or an individual's information",
  "instead.",
  "Trust as Member",
  "Please be advised that in order to have a Trust as a member, the State",
  "of Ilinois is requesting the filing to be sent by paper, and currently,",
  "Bizee.com doesn't offer that service, please provide either an individual",
  "or active company information instead",
  "Please be advised that as per the State, a revocable or irrevocable",
  "trust cannot be a member of a limited liability company in Texas",
  "because such trusts do not have the ability to take actions in and of",
  "themselves.",
  "TX",
  "Invalid Address",
  "Please be advised that the address “8 The Green A Dover, DE 19901”",
  "can be rejected by the State as is an Invalid Address to use for many",
  "companies. Please provide a new address to proceed.",
  "DE",
  "Titles, MR, MRS, DR",
  "Honorifics, courtesy titles and professional Designations are not",
  "allowed by the state. Please provide a full name as in Federal ID.",
  "No initials Allowed In",
  "Member/RA Name",
  "Initials are not allowed by the state. Please provide a full name as in",
  "Federal ID.",
  "Entity’s name doesn’t Please provide the company name Exactly as registered in the state",
  "match the State",
  "with the designator. Thank you.",
  "Records",
  "RA/Member Authorized signer",
  "Please provide the name of the Authorized signer for the company",
  "\"_____\" in order to proceed with the filing. Thank you.",
  "Special characters in",
  "a name",
  "Please be advised that the State doesn't allow special characters,",
  "please provide the _____ name with letters found on a standard",
  "American or U.S. qwerty keyboard.",
  "request Purpose",
  "Restricted Word in",
  "Purpose",
  "The word “___” is restricted in the state. Please rephrase the purpose",
  "so we can continue with the filing. Thank you.",
  "Purpose Not Specific In the purpose section, we need to provide the description of your",
  "economic activity to the SOS otherwise it will get rejected. For",
  "example: If it’s a restaurant, the purpose will be: sell food. Please",
  "provide a suitable purpose to continue with the filing. Thank you.",
  "NM",
  "OH",
  "Purpose Not Specific The state requires a more specific purpose, asking what specific",
  "Or Vague",
  "service your company will do to make a profit. Please send us a",
  "suitable and specific purpose so we can proceed. Thank you.",
  "PURPOSE",
  "The state will not be accepting your company purpose it’s requiring a",
  "more specific purpose, they want to know what specific service your",
  "company will do, such as photography, lawn service, painting,",
  "consulting, etc. Please send us a more specific company purpose so",
  "we can proceed. Thank you.",
  "Purpose in a",
  "different languaje",
  "The state requires your company’s purpose to be in English. Please",
  "send us the English version of your purpose so we can proceed. Thank",
  "you.",
  "Name Issue",
  "NAICS Code,",
  "Purpose doesn’t",
  "Please be advised that the NAICS Code and the Purpose must align.",
  "Please verify this information so we can proceed with your order.",
  "NFP Purpose",
  "The purpose implies that you would be forming a Nonprofit.",
  "If you want to file a NON Profit, you need to change your entity type,",
  "this must also change the designator and other information, but if you",
  "are trying to file an LLC please clarify how the company will be making",
  "profit.",
  "Entity RA not",
  "commercial, Service",
  "Company",
  "The agent listed is not a Service Company in the State of Louisiana.",
  "Please provide an agent as a person or a Service Company authorized",
  "to act as a Registered Agent in the State.",
  "RA LLC as Agent",
  "A Limited Liability Company is not authorized to be a Registered Agent",
  "in New Mexico . Please provide an individuals information or an Active",
  "Corporation instead to proceed with your filing. Thank you.",
  "in Missouri . Please provide an individuals information or an Active",
  "commercial, CROP",
  "The agent listed does not have a CROP filed with the state of PA.",
  "Please provide an agent as a person or a company that has a",
  "Commercial Registered Office Provider.",
  "corresponds to a",
  "Commercial Agent",
  "Please be advised that the Address ____ belongs to the Commercial",
  "Registered Agent \"___\" and cannot be used for an Individual. Please",
  "provide a New Address or a New Registered Agent information to",
  "continue. Thank you.",
  "RA Individual (Last",
  "Name to long)",
  "FL state allows no more than 20 characters for the Registered Agent’s",
  "last name. Please abbreviate it for ______.",
  "RA Individual (First",
  "FL state allows no more than 14 characters for the Registered Agent’s",
  "first name. Please remove the middle name or abbreviate it for ______.",
  "Blocked RA",
  "The company acting as a Registered Agent is blocked by the state of",
  "Delaware and cannot be used as such. Please provide another",
  "company or an individual so we can continue with the filing. Thank you.",
  "LLC as Registered",
  "Agent",
  "Limited Partnerships, Limited Liability Companies, Limited Liability",
  "Partnerships, Professional Limited Liability Company and Registered",
  "Limited Liability Partnership are not authorized to be a Registered",
  "Agent in Alaska. Please provide an Active Corporation or an individuals",
  "information instead to proceed with your filing. Thank you.",
  "RA Entity (Name to",
  "long)",
  "FL State allows no more than 42 characters for the Business to serve",
  "as Registered Agent's name. Please provide a shorter Active entity",
  "information or an individual's information instead to proceed with your",
  "filing.",
  "commercial, CRA",
  "Please be advised that if an Entity will act as Registered Agent, it must",
  "be a Wyoming Commercial Registered Agent. Please send us a",
  "Commercial Company or an individual information instead.",
  "be a Maine Commercial Registered Agent. Please send us a",
  "ME",
  "commercial",
  "be a Washington DC Commercial Registered Agent. Please send us a",
  "RA is not a Member",
  "of the LLC",
  "A Registered Agent must be a Member or Manager of the LLC. Please",
  "provide the name of a Member/Manager of this company",
  "RA is not a Director",
  "of the CORP",
  "A Registered Agent must be also a Director of this Corporation. Please",
  "provide the name of a Director of this company.",
  "RA (LLC As Agent",
  "Issue.) CORPs",
  "Agent in a Corporation . Please provide an individuals information",
  "instead to proceed with your filing. Thank you.",
  "NY",
  "in Massachusetts . Please provide an individuals information or an",
  "Active Corporation instead to proceed with your filing. Thank you.",
  "Foreign Entity as RA",
  "A Foreign LLC, or a Foreign Corporation are not authorized to be a",
  "Registered Agent in Maryland. Please provide a Domestic Company",
  "information or an individual information instead to proceed with your",
  "RA address wrong",
  "county",
  "It seems that the address you entered has the wrong county. The",
  "correct county is ______ Please change the county so we can continue",
  "with the filing. Thank you.",
  "Company As Its Own",
  "A company cannot act as its own REGISTERED AGENT, but the owner",
  "of the company can be listed instead. please provide a valid entity",
  "information or an individuals information instead to proceed with your",
  "RA address, POST in",
  "the Street Name",
  "The state is not accepting this address because the word \"POST\" is",
  "included. please provide us with a new address to proceed. Thank you",
  "GA",
  "Agent Not Found On",
  "State",
  "Please be advised that we haven't been able to find _____ as an active",
  "company in the state of _____ that you are trying to use as Registered",
  "Agent. Please provide an active entity's information, including the",
  "designator of the company or an individual's information instead. Thank",
  "you",
  "NV",
  "MI",
  "Show 23 more",
  "Agent Not Found on",
  "State LLC",
  "Entity as Registered",
  "Please be advised that a Limited Liability Company cannot be",
  "appointed as registered agent. Please provide a Corporation Active in",
  "New Mexico or an individual’s information instead. Thank you.",
  "CORP, Agent is an",
  "LLC",
  "Please be advised that a Limited Liability Company cannot be a",
  "registered agent for an Incorporation. Please provide a Corporation",
  "Active in New York or an individual’s information instead. Thank you.",
  "Entity not Authorized If an entity will act as a Registered Agent, it must be on the state list of",
  "as RA",
  "the companies that provide service of process services. Please",
  "provide a different Registered Agent, or provide an individual's",
  "information instead. Thank you.",
  "The agent listed does not have a 1505 filed with the state of CA.",
  "Please provide an agent as a person or a company that has a 1505.",
  "Once we receive this, then we can continue with your filing.",
  "Trust as RA",
  "A trust can not act as a Registered agent. Please provide an active",
  "company or a person in order to proceed with the filing for your",
  "company. Thank you.",
  "required",
  "Law Firm As RA",
  "Please be advised that a law firm cannot act as the Registered Agent",
  "of a company. The permitted Registered Agents are individuals residing",
  "in the state and foreign or domestic companies active in the state",
  "(LLCs, CORPs). Please provide an active entity information or an",
  "individual’s information instead.",
  "VA Service as RA",
  "Please be advised that the Virtual address cannot be listed as the",
  "Registered Agent Address. The state statute requires that the",
  "registered agent’s address must be a street address in _______, and the",
  "agent must be located at that address. A post office box or “mail drop”",
  "or virtual address may not be used as the registered agent address.",
  "Please provide an appropriate address so we can proceed.",
  "Address, Offer RA",
  "Our virtual address can't be used as the registered agent address, if",
  "you want to use our Registered Agent Service you can subscribe to",
  "our Service at",
  "https://bizee.com/form/manage-your-company/registered-agent,",
  "otherwise provide us with a new physical address. Thank you.",
  "Cancel and",
  "Refund",
  "PLLC",
  "The information of the company that you're trying to file seems to be in",
  "the category of Professional Limited Liability Company. The Section",
  "1203 of the New York State LLC Law requires all individuals who have",
  "been legally authorized to provide a Licensed professional service",
  "“______” to form a Professional Entity. Bizee.com does not currently",
  "offer that service. Thank you",
  "the category of Professional Entity. The Louisiana Statute requires that",
  "any Limited Liability Company or Corporation to be formed with the",
  "Purpose of practice of dentistry, and/or hold property for investment or",
  "in connection with its dental practice to form a Professional DENTAL",
  "Limited Liability Company and Bizee.com does not currently offer that",
  "service. Thank you",
  "Cannabis control",
  "We are unable to file your company as the Use, Sale, Growth and",
  "Distributions of Cannabis in Massachusetts requires prior authorization",
  "from the Cannabis Control Commission, and we currently don’t file for",
  "companies with that specific purpose. Thank you.",
  "the category of Professional Limited Liability Company. The Rule",
  "12.02(b) and W.Va. Code §31B-13-1301 requires all individuals who",
  "have been legally authorized to provide a Licensed professional service",
  "WV",
  "the category of Professional Limited Liability Company. A limited",
  "liability company may elect professional limited liability company status",
  "under § 79-29-903 for the purpose of rendering professional services,",
  "this service may be lawfully rendered only by a person licensed or",
  "otherwise authorized by a licensing authority in Mississippi to render",
  "the service “______”. Currently Bizee.com does not offer this service.",
  "MS",
  "the category of Professional Limited Liability Company. The state of",
  "Michigan Statute Act 23 of 1993 Section 450.4904 requires all",
  "individuals who have been legally authorized to provide a Licensed",
  "professional service “_____” to form a Professional Entity. Bizee.com",
  "does not currently offer that service. Thank you",
  "Washington Statute RCW 25.15.048 requires all individuals who have",
  "“_____” to form a Professional Entity. Bizee.com does not currently",
  "Vermont Statute Chapter 25 requires all individuals who have been",
  "legally authorized to provide a Licensed professional service “_____” to",
  "form a Professional Entity. Bizee.com does not currently offer that",
  "Utah Statute Chapter 48-3a-1101 and 48-3a-1106 requires all",
  "PC",
  "the category of Professional Corporation. The state of Utah Statute",
  "Chapter 11 Code 16-11-2 requires all individuals who have been legally",
  "authorized to provide a Licensed professional service “_____” to form a",
  "Professional Entity. Bizee.com does not currently offer that service.",
  "the category of Professional Corporation. The state of Wisconsin",
  "Statute Subch XIX of ch 180 requires all individuals who have been",
  "WI",
  "New Hampshire Statute Chapter 304-D requires all individuals who",
  "South Dakota Statute 47-11F-13 requires all individuals who have been",
  "SD",
  "Alabama Statute requires all individuals who have been legally",
  "authorized to provide a Licensed professional service “______” to form a",
  "Professional Entity under the Section 10A-5A-8.01. Bizee.com does not",
  "currently offer that service. Thank you",
  "Montana Statute requires all individuals who have been legally",
  "Professional Entity under the Title 35, Chapter 8, Part 13. Bizee.com",
  "the category of Professional Corporation. The state of Alabama Statute",
  "requires all individuals who have been legally authorized to provide a",
  "Licensed professional service “______” to form a Professional Entity",
  "under the Section 10A-1-1.03(80). Bizee.com does not currently offer",
  "that service. Thank you",
  "the category of Professional Corporation. The state of Oregon Statute",
  "under the ORS Chapter 58. Bizee.com does not currently offer that",
  "the category of Professional Corporation. The state of Ohio, Chapter",
  "1785 requires all individuals who have been legally authorized to",
  "provide a Licensed professional service “_______” to form a Professional",
  "Entity. Bizee.com does not currently offer that service. Thank you",
  "the category of Professional Corporation. The state of South Carolina",
  "Statute, Title 33, Chapter 19 requires all individuals who have been",
  "legally authorized to provide a Licensed professional service “_______”",
  "to form a Professional Entity. Bizee.com does not currently offer that",
  "the category of Professional Corporation. The state of South Dakota",
  "Statute 47-01-33 requires all individuals who have been legally",
  "authorized to provide a Licensed professional service “_______” to form",
  "a Professional Entity. Bizee.com does not currently offer that service.",
  "the category of Professional Corporation. The state of Rhode Island,",
  "Chapter 7-5.1 requires all individuals who have been legally authorized",
  "to provide a Licensed professional service “_______” to form a",
  "the category of Professional Corporation. The state of Vermont",
  "Chapter 004, Title 11A requires all individuals who have been legally",
  "the category of Professional Corporation. The state of New Hampshire",
  "Statute Chapter 294-A requires all individuals who have been legally",
  "the category of Professional Corporation. The State of MS Statute",
  "under § 79-10-1 through 79-10-117 requires all individuals who have",
  "been authorized by a licensing authority in Mississippi to render the",
  "service “______” to form a Professional Entity. Currently Bizee.com does",
  "not offer this service. Thank you.",
  "the category of Professional Corporation. The Chapter 30 of West",
  "Virginia Code requires all individuals who have been legally authorized",
  "to provide a Licensed professional service “______” to form a",
  "Professional Entity. Currently Bizee.com does not offer this service.",
  "the category of Professional Corporation. The state of Nebraska",
  "Statute 21-2202 requires all individuals who have been legally",
  "the category of Professional Corporation. The state of Michigan",
  "Statute Act 284 of 1972 Chapter 2A requires all individuals who have",
  "the category of Professional Corporation. The state of Washington",
  "Statute RCW Chapter 18.100 requires all individuals who have been",
  "the category of Professional Limited Liability Company. The Chapter",
  "55B and Chapter 57D of the North Carolina General Statutes requires",
  "all individuals who have been legally authorized to provide a Licensed",
  "professional service “_______” to form a Professional Entity. Bizee.com",
  "the category of Professional Corporation. The Chapter 55B and",
  "Chapter 57D of the North Carolina General Statutes requires all",
  "the category of Professional Limited Liability Company. The DC Statute",
  "requires that any type of personal service to the public which may be",
  "lawfully rendered only pursuant to a license and including the services",
  "performed by certified public accountants, attorneys, architects, health",
  "professionals and professional engineers as defined under D.C. Law 699; D.C. Official Code § 3-1201.01(8) to form a Professional Entity.",
  "Bizee.com does not currently offer that service. Thank you",
  "the category of Professional Corporation. The DC Statute requires that",
  "any type of personal service to the public which may be lawfully",
  "rendered only pursuant to a license and including the services",
  "Bizee.com does not currently offer that service. Thank you.",
  "the category of Professional Limited Liability Company. The",
  "Massachusetts General Statutes Under the provisions of M.G.L. c.",
  "156A requires all individuals who have been legally authorized to",
  "the category of Professional Corporation. The Massachusetts General",
  "Statutes Under the provisions of M.G.L. c. 156A requires all individuals",
  "who have been legally authorized to provide a Licensed professional",
  "service “_______” to form a Professional Entity. Bizee.com does not",
  "the category of Professional Limited Liability Company. “Limited liability",
  "companies rendering certain professional services must form as a",
  "restricted professional company.” The state of Pennsylvania Statute",
  "requires all Individuals who have been legally authorized to provide a",
  "Licensed professional service “________” form a Professional Entity.",
  "Bizee.Com does not currently offer that service. Thank you",
  "the category of Professional Corporation. The state of Pennsylvania",
  "Statute requires all Individuals who have been legally authorized to",
  "provide a Licensed professional service “__________” form a",
  "Professional Entity. Bizee.Com does not currently offer that service.",
  "the category of Professional Corporation. The state of Texas Statute",
  "Licensed professional service “________” to form a Professional Entity.",
  "Texas Statute requires all individuals who have been legally authorized",
  "to provide a Licensed professional service “________” to form a",
  "the category of Professional Limited Liability Company. A California",
  "limited liability company may not provide professional services in",
  "California. (California Corporations Code sections 13401 and",
  "17701.04(e).) The state of California Statute require all entities that",
  "provide a Professional service “_______“ to form a Professional",
  "Corporation. Bizee.Com does not currently offer that service. Thank",
  "the category of Professional Corporations. The state of California",
  "Statute (13401.5) require all entities that provide a Professional",
  "service “________“ to form a Professional Corporation. Bizee.Com does",
  "not currently offer that service. Thank you",
  "the category of Professional Corporations. The Indiana Code 23-1.5-111 and 23-1.5-2-5 require all entities that provide a Professional",
  "the category of Professional Corporstion. The state of Montana",
  "Statute requires all individuals who have been legally authorized to",
  "provide a Licensed professional service “______” to form a Professional",
  "Entity under the Title 35, Chapter 4. Bizee.com does not currently offer",
  "Oklahoma Statute (§18-804) requires all individuals who have been",
  "legally authorized to provide a Licensed professional service “________”",
  "the category of Professional Corporation. The state of Oklahoma",
  "Statute (§18-804) requires all individuals who have been legally",
  "authorized to provide a Licensed professional service “________” to form",
  "the category of Professional Corporations. The Title 5, Subtitle 1 / § 5–",
  "101 of the Maryland General Statutes requires all individuals who have",
  "“________” to form a Professional Entity. Bizee.com does not currently",
  "the category of Professional Limited Liability Company. The Kansas",
  "General Statutes pursuant to K.S.A. 17-2709 requires all individuals",
  "KS",
  "the category of Professional Corporation. The Kansas General",
  "Statutes pursuant to K.S.A. 17-2709 requires all individuals who have",
  "“_______” to form a Professional Entity. Bizee.com does not currently",
  "496 and 489.1105 of the Iowa General Statutes requires all individuals",
  "the category of Professional Corporation. The Chapter 496 and",
  "489.1105 of the Iowa General Statutes requires all individuals who",
  "the category of Professional Corporation. The state of Hawaii Statute",
  "(Hawaii Corporations Act CHAPTER 415A) require all entities that",
  "provide a Professional service “______ “ to form a Professional",
  "HI",
  "Illinois Statute requires all individuals who have been legally",
  "the category of Professional Corporation. The state of Illinois Statute",
  "Licensed professional service “______” to form a Professional Entity.",
  "the category of Professional Limited Liability Company. The Idaho",
  "Code § 30-21-301 requires all individuals who have been legally",
  "the category of Professional Corporation. The Idaho Code § 30-21901(b) requires all individuals who have been legally authorized to",
  "the category of Professional Corporation. The Section 1501(b) of the",
  "Business Corporation Law of the New York Statute requires all",
  "professional service “______” to form a Professional Entity. Bizee.com",
  "Name Rejected",
  "several times",
  "Please be advised that the State is rejecting your name because there",
  "is a company on file with the name “_________\" and is not taking in",
  "consideration any extra words. The new name may be considered to",
  "similar and can be rejected too. Please choose a different name so we",
  "can continue with the filing. Thank you.",
  "Name Is Not",
  "Available",
  "Company name is not available. There is an existing company",
  "registered in the State with a similar name. Changing between",
  "plural/singular, homophones, duplicating letters, location designators,",
  "company designators, adding or removing extra spaces, suffixes,",
  "punctuation marks or adding words such as“ the”, “a”, “and”, “&” DOES",
  "NOT distinguish one name from another. Please send us a new",
  "company name so we can proceed with the order.",
  "Available 2",
  "The name submitted is currently not available or is confusingly similar.",
  "Please provide a new name. Thank you.",
  "Missing designator",
  "The company’s name is missing the designator. Please add the",
  "designator (LLC, L.L.C., etc) so we can proceed with the filing. Thank",
  "Available 1",
  "This company name is already taken. Please provide a different name",
  "to continue. Thank you.",
  "Name in pending",
  "dissolution or",
  "inactive",
  "The state is not accepting this company name since its status appears",
  "as \"Pending Inactive\". Please choose a different name to continue.",
  "Corporations",
  "designator (CORP, CO, INC, etc) so we can proceed with the filing.",
  "Name With 3",
  "Business Name must be at least 3 characters in length, excluding",
  "Characters In Length leading articles, trailing 's', spaces, punctuation and conjunctions (THE,",
  "AND, OR, OF, &). Please consider that most of the 3-lettered names are",
  "already taken. Provide a new company name to proceed with your",
  "order. Thank you.",
  "3-lettered names",
  "The company name you selected is not available in the Selected State.",
  "Consider that most of the 3-lettered names are already taken. Please",
  "provide a different name to proceed with the filing. Thank you.",
  "DBA, AKA, ABN",
  "Entities may file using only the corporate name. Please delete any",
  "reference to the \"doing business as name\" (DBA) in your company",
  "name _________. If you wish to register your fictitious name, you may do",
  "so by placing a DBA order from your Dashboard.",
  "Name Misspelling",
  "The state does not allow misspelling on the Company name. Please",
  "correct the spelling to proceed with your filing. Thank you.",
  "Company Name to",
  "GA state allows no more than 80 characters for the Company name.",
  "Please provide a new name.",
  "State Designation",
  "The state of Oklahoma do not distinguish between cities and the",
  "abbreviations. We need to make phonetical difference, add a few extra",
  "words or rephrasing the name to make it more distinguishable.",
  "Name is not",
  "The name of an administratively dissolved Illinois LLC is not available",
  "for use by another LLC or Corporation until 3 years have elapsed",
  "following the date of issuance of the notice of dissolution.",
  "Special Characters",
  "Special characters are not allowed in the state of _____ . Please",
  "provide a new company name.",
  "Name with 3 or less",
  "Characters in length",
  "Business Name must be at least 4 characters in length, excluding",
  "leading articles, trailing 's', spaces, punctuation and conjunctions (THE,",
  "Client owns the",
  "Name",
  "It seems you already have a company with the same name registered",
  "in the SOS, if you want to continue with this order we will need a new",
  "company name. Please rephrase your company’s name or try adding an",
  "extra word to make it more distinguishable. Thank you",
  "Restricted Word",
  "The term “___” is regulated by the State, please rephrase your",
  "company's name to proceed with your filing. Thank you.",
  "Company Name With Profanity words “____” are not allowed in the company name. Please",
  "Profanity Word",
  "provide a new name so we can proceed.",
  "Phonetical",
  "Designator",
  "The state might reject your company's name because \"INK\" is",
  "phonetically similar to a company designator. Only one designator is",
  "allowed. Please provide us with a new company name in order to",
  "proceed. Thank you.",
  "Location Designator",
  "The phrase “______” might not change the company name. since it is",
  "considered a location designator. Please give a new name so we can",
  "move forward with the filing. Thank you.",
  "Company Name",
  "starts with “A”",
  "WY doesn't accept company names that start with an A, example (A",
  "enterprises, A sun, A Holdings), please give us a different name so we",
  "can continue with your filling. Thank you",
  "The information of the company that you're trying to file “_______ “ and",
  "purpose “____” seems to be in the category of Professional Limited",
  "Liability Company. We can cancel/refund the order as Bizee.com does",
  "not currently offer that service. If you wish to proceed as a General",
  "Limited Liability Company we can process the filing. Please advise how",
  "you wish to proceed. Thank you.",
  "purpose “____” seems to be in the category of Professional",
  "Corporation. We can cancel/refund the order as Bizee.com does not",
  "currently offer that service. If you wish to proceed as a General",
  "Corporation we can process the filing. Please advise how you wish to",
  "The information of the company that you're trying to file “____ “ and",
  "PLLC probably",
  "rejection",
  "The word “_____” in your company's name will probably get rejected by",
  "the state, as it implies a professional service is being provided. Please",
  "rephrase the Name of your company or let us know if you want to",
  "continue with the name provided so we can proceed with the filing. If",
  "you’re trying to file of a Professional Limited Liability Company we can",
  "cancel/refund the order as Bizee.com does not currently offer that",
  "service.",
  "PC probably",
  "you’re trying to file of a Professional Corporation we can cancel/refund",
  "the order as Bizee.com does not currently offer that service.",
  "your trying to file of a Professional Corporation we can cancel/refund",
  "The proposed name includes a phrase “________” that is normally used",
  "for a professional entity only. If you believe that the phrase is being",
  "used in a context that does not imply a professional entity, we may",
  "continue with the filing. Please be advised, that if this name is later",
  "found to be unacceptable by the Department of State, the entity will be",
  "required to amend its name, or risk becoming suspended. If you are",
  "trying to file a Professional Entity, we may cancel and refund this order",
  "as Bizee.com does not currently offer that service. Thank you",
  "PLLC/PC, Restricted",
  "word",
  "SHARES",
  "Please provide the Total Number of Shares and The Par Value of each",
  "Share, as requested by the State of ________.",
  "Par Value is too low",
  "The Value of each share needs to be more than 0.01. Please update",
  "the par value so we can continue with your filling. Thank you.",
  "Shares value is too",
  "low",
  "The total value of the shares needs to be at least 1 dollar. Please",
  "update the number of shares and/or the par value so we can continue",
  "with your filling. Thank you.",
  "Shares",
  "It seems you have exceeded the number of shares allowed in the state",
  "of AL. The maximum number of shares should be 1,000,000,000.00 if",
  "you want to proceed, please provide a new number of shares. Thank",
  "of CT. The maximum number of shares should be 20,000 if you want",
  "to proceed, please provide a new number of shares. Thank you.",
  "Shares exceed the",
  "value allowed",
  "The total value of the shares needs to be less than $75,000 dollars.",
  "Please update the number of shares and/or the par value so we can",
  "continue with your filling. Thank you.",
  "of NY, you have entered _________. The number of shares must not",
  "have a decimal point and must be greater than 0 and must be less than",
  "1,000,000. Please let us know how to proceed. Thank you.",
  "Consideration",
  "amount of Shares",
  "(Shares*Par Value)",
  "to low",
  "Please be advised the state of Illinois requires the Consideration",
  "amount of the shares to be a whole number. The value currently is",
  "Shares ____ * Par Value $______ = $_____. Please increase the share",
  "amount or the Par Value so the minimum value is at least $1.00 or",
  "higher.",
  "exceeded",
  "amount of the shares must be less than $16,667.00. The value",
  "currently is Shares ____ * Par Value $______ = $_____. Please decrease",
  "the share amount or the Par Value so the consideration value is less",
  "than $16,667.00",
  "Par Value",
  "It seems you have exceeded the value per share allowed in the state of",
  "NY, you have entered _________. Value per share must be a number",
  "greater than _____ and less than ______. Please let us know how to",
  "Authorized Stock",
  "Please be advised the stock authorized by state of Maryland must be",
  "less than $100,000.00. The currently stock is Shares ______ * Par",
  "Value $______ = $______. Please decrease the share amount or the Par",
  "Value so the stock value is less than $100,000.00",
  "The filing fee of the Corporation is based in the total value of the",
  "shares, if more than $100,000 dollars the fee will increased. Please",
  "Fee we have",
  "The filing fee of the Corporation is based in the Authorized shares, if",
  "more than 275,000 shares the fee will increased. Be advised that we",
  "don’t file companies with more than 275,000 shares, please decrease",
  "your shares or we can cancel and refund your order.",
  "more than 60,000 shares the fee will increased. Be advised that we",
  "don’t file companies with more than 60,000 shares, please decrease",
  "Name Reservation",
  "Company name not available at the State. We found that there is an",
  "active Name Reservation for this company name. If it has been",
  "reserved by you, we will need a copy of the name reservation",
  "certificate. We will need a new company name if it is not your name",
  "reservation. Please let us know how to proceed. Thank you.",
  "Show 6 more",
  "VA Directors",
  "The state is no longer allowing virtual address, PO. Box, or any other",
  "mailing facility location for Directors. Please let us know if you prefer",
  "to change the address to a physical address or to not show the",
  "Directors information in the articles. Thank you",
  "RA Entity",
  "Please provide **1. The name of the Authorized Agent to sign on",
  "behalf of _______. ** 2. The Email address of the Registered Agent, **",
  "3. The phone number of the Registered Agent.",
  "Entity as RA (another Please be advised that the state of New Mexico requires a signed",
  "company as Agent)",
  "Agent Acceptance form provided by the Registered Agent. Please",
  "email us so we can provide you with the form. Please fill and sign the",
  "form and send us the form in pdf format so we can proceed with the",
  "More than 5",
  "Members",
  "Please be advised that the state of Missouri only allows 5 members in",
  "a company when doing online filing. If you wanna keep the 6 members",
  "or more in your company, the filing has to be by paper. If you wish to",
  "proceed with the online filing, one of the members has to be removed,",
  "otherwise we can cancel and refund your order as we don’t offer paper",
  "filing in this State.",
  "Virtual Address",
  "Please be advised that the state of Illinois has recently passed a",
  "legislation prohibiting the use of a virtual address as the principal",
  "address of a business. The state does not accept a postal, shipping, or",
  "mailing center addresses, UPS, FEDEX, PO Boxes, or PMBs. Please",
  "send us a physical company address so we can proceed. Thank you.",
  "the category of Professional Limited Liability Company. The Title 48,",
  "Part 6 of the Tennessee Code requires all individuals who have been",
  "to form a Professional Entity. We can cancel/refund the order as",
  "Bizee.com does not currently offer that service. If you wish to proceed",
  "as a General Corporation we can process the filing. Please advise how",
  "Approval Doc",
  "The word “_______” in your company's name requires Approval from the",
  "_______ Division. Please rephrase the Name of your company or provide",
  "the approval required to upload with the online filing. If you're trying to",
  "file of a Professional Entity we can cancel/refund the order as",
  "Bizee.com does not currently offer that service.",
  "DAO, additional",
  "designation",
  "Your Company name implies that you would be forming a Decentralized",
  "Autonomous Organization (DAO). If you want to file a DAO LLC, we",
  "cancel and refund this order, as we currently only file for Regular LLCs.",
  "If you want to proceed, please remove the word DAO. Let us know how",
  "to proceed.",
  "Partnership",
  "Your company name implies that you would be forming a Partnership.",
  "If you want to file a LP or LLP, let us know so we can cancel and refund",
  "this order, as we currently do not offer that Service. If you want to",
  "continue as an LLC, let us know to proceed.",
  "ABN",
  "Please be advised that in order to Continue with the Name Provided",
  "you may: 1. Cancel your assumed business name. or 2. Change the",
  "\"registrant\" (owner), of your assumed business name to your new",
  "business instead of yourself.",
  "WARN",
  "___ . Please rephrase your company name, or let us know if you want to",
  "proceed with the name given. Thank you.",
  "Client wants a CORP",
  "The purpose implies that you would be forming a CORPORATION.",
  "If you want to file a C or S CORP, you need to change your entity type,",
  "are trying to file an LLC please update your purpose and let us know so",
  "we can continue.",
  "Address in MT",
  "Please be advised, due to the recent number of fraudulent filings",
  "occurring at the Montana Secretary of State's Office, the state has put",
  "in place extra steps to validate a business entity. Please provide a copy",
  "of the contract or lease agreement that shows you are at the address",
  "on your application. Please reply to the email with the requested",
  "documents so we can proceed with the filing.",
  "Address not In State",
  "Company address must be within the state of ____. Please provide an In",
  "State address so we can continue with the filing. Thank you.",
  "More than 6",
  "Please be advised that the State of Tennessee calculates its fees by",
  "the number of members, the filing fee for the Articles of Organization",
  "will be $50 per member added, with a minimum fee of $300 and a",
  "maximum fee of $3,000. Be advised that we only file for companies",
  "with 6 or less members, please make the changes needed so we can",
  "Past Due Franchise",
  "Tax",
  "Dear client your company got rejected for the following reasons: 1.(NAME OF THE PERSON) is listed on filing number (STATE ID COMPANY NAME) that is in ________ status. Per statute 26-54-114 No",
  "person shall be allowed to file any initial filings with the Secretary of",
  "State if that person is connected to any company that owes past-due",
  "franchise taxes.",
  "RA and Member",
  "same as company",
  "Arizona will not accept the name, because a company can't act as its",
  "own Registered Agent and member, and even if the Agent and the",
  "member are a person, the state sees it like the same, please provide a",
  "different name, or a different Registered Agent and member, thank you",
  "Trade Name",
  "Company name not available at the Selected State. We found that",
  "there is an active Trade Name Registration for this company name. If it",
  "yours, we will need a copy of the Trade Name certificate. If it is not",
  "your Trade Name registration, we will need a new company name.",
  "Please let us know how to proceed. Thank you.",
  "Trade Name, Owner",
  "doesn’t match",
  "Dear client, the state will reject your trade name since the name you",
  "provide us is \"Karen Nunley\" and the TRADE NAME CERTIFICATION",
  "you provide us, has been made by \"Karen Hair by karenn\". Please, If",
  "you want the name you reserve, you'll need to call the state to resolve",
  "this issue, because that's something only the trade name owners can",
  "do. Please let us know how to proceed, Thank you.",
  "The Company name is not available at the Selected State. We found",
  "that there is an active Trade Name for this company name. If it’s yours",
  "and you wish to use this name, you would need to cancel the Trade",
  "name. But if it is not your Trade Name, please provide us with a more",
  "distinguishable name for us to be able to proceed with your order.",
  "MN",
  "that there is an active Assumed Business Name for this company",
  "name. If it’s yours and you wish to use this name, you would need to",
  "cancel the ABN. But if it is not your Assumed Business Name, please",
  "provide us with a more distinguishable name for us to be able to",
  "proceed with your order. Thank you.",
  "NAICS Code Missing",
  "Please provide the NAICS CODE and NAICS SUB CODE which the",
  "company classifies under. https://www.naics.com/search/",
  "We found that there is an active Name reservation for this company",
  "name. If it has been reserved by you, we won't be able to proceed with",
  "your order. This filing would need to be completed in a personal",
  "manner if you wish to use the name reserved, therefore we would need",
  "to cancel and refund your order. But if it is not your Name reservation",
  "registration, please provide us with a more distinguishable name for us",
  "to be able to proceed with your order. The second option is that you",
  "submit a cancellation of the name reservation to the state and then we",
  "can proceed with the online filing. Please review and advise. Thank you",
  "Same member’s",
  "name but from",
  "another State",
  "Texas will not accept the name, because a company can't act as its",
  "own Member, and even if the Member is an active company from a",
  "different State, the state sees it like the same, please provide a",
  "different name, or a different member, thank you",
  "the category of Professional Limited Liability Company. The MN",
  "Statutes Sections 319B.01 to 319B.12 requires all individuals who have",
  "“________” to form a Professional Entity. We can cancel/refund the order",
  "as Bizee.com does not currently offer that service. If you wish to",
  "proceed as a General LLC we can process the filing. Please advise how",
  "Double Designators",
  "Please be advised the state regulation does not allow both “_____” and",
  "“_____\" as designators, only 1 is allowed in a name. Also _____ is a",
  "designator for corporations and non-profits and not allowed in a LLC",
  "name. Please send us a new company name so we can proceed with",
  "the order.",
  "CORP",
  "Please be advised the state regulation does not allow a Company to",
  "have two designators “___” & “___”. Please remove one designator from",
  "the company name to avoid a rejection by the state. Thank you.",
  "The company name you selected includes the word \"UNLIMITED\"",
  "which might be taken as designator, please provide a different name to",
  "avoid a rejection by the state. Thank you.",
  "The company name you selected includes the word/designator",
  "\"LIMITED\" which is not allowed by the State, please provide a different",
  "name to avoid a rejection by the state. Thank you.",
  "the category of Professional Corporation. The MN Statutes Sections",
  "319A.01 to 319A.12 requires all individuals who have been legally",
  "a Professional Entity. We can cancel/refund the order as Bizee.com",
  "does not currently offer that service. If you wish to proceed as a",
  "General Corporation we can process the filing. Please advise how you",
  "wish to proceed. Thank you.",
  "the category of Professional Corporation. The MO General Statutes",
  "Title XXIII, Chapter 356 requires all individuals who have been legally",
  "VA Similar to our VA",
  "Please be advised that we are unable to file the company with the",
  "address provided ________ as it is located in the same building that our",
  "Virtual Address Service, which will create a conflict with the logistic of",
  "receiving and delivering mail. Please provide a different company",
  "address or you can can subscribe to our Service at",
  "https://bizee.com/form/virtual-mailbox . We apologize for the",
  "inconvenience.",
  "purpose “____” seems to be in the category of Professional Corporation",
  "(AS 10.45.050). We can cancel/refund the order as Bizee.com does not",
  "the category of Professional Corporation. The NJ General Statutes",
  "(Title 14A Section 14A 17-5) requires all individuals who have been",
  "the category of Professional Corporation. The NM General Statutes",
  "(Article 6- 56-61 to 53-6-14 NMSA 1978) requires all individuals who",
  "proceed as a General Corporation we can process the filing. Please",
  "advise how you wish to proceed. Thank you.",
  "the category of Professional Corporation. The Kentucky General",
  "Statutes (KRS Chapter 274) requires all individuals who have been",
  "KY",
  "the category of Professional Limited Liability Company. Pursuant to",
  "KRS 14A and KRS 275 of the Kentucky General Statutes requires all",
  "professional service “________” to form a Professional Entity. We can",
  "service. If you wish to proceed as a General Limited Liability Company",
  "we can process the filing. Please advise how you wish to proceed.",
  "the category of Professional Corporation. The Title 48, Part 11 of the",
  "Tennessee Code requires all individuals who have been legally",
  "Nevada Statute (NRS CHAPTER 89) requires all individuals who have",
  "“_________” We can cancel/refund the order as Bizee.com does not",
  "currently offer that service. If you wish to proceed as a General Limited",
  "Liability Company we can process the filing. Please advise how you",
  "the category of Professional Corporation. The state of Nevada Statute",
  "(NRS CHAPTER 89) requires all individuals who have been legally",
  "authorized to provide a Licensed professional service “_________” We",
  "can cancel/refund the order as Bizee.com does not currently offer that",
  "service. If you wish to proceed as a General Corporation we can",
  "process the filing. Please advise how you wish to proceed. Thank you.",
  "Company as",
  "member",
  "Please provide the state in which the company is registered so that we",
  "can proceed with your filling. Thank you.",
  "RA email required",
  "The Registered Agent in the state of Connecticut needs to accept a",
  "Registered Agent appointment. Please send us the email address of",
  "the authorized Agent so we can continue with the filing. Thank you.",
  "Name meaning",
  "The State of Delaware is asking for a translation or explanation for",
  "company names with words that are in other languages or are",
  "combinations/creations. Please send us the meaning of the word “_” so",
  "we can continue with the filing. Thank you.",
  "Spelling",
  "Confirmation",
  "Spelling Check",
  "Please check the spelling and confirm _______",
  "Company Address in",
  "other State",
  "Company address must be within the state of South Carolina. Please",
  "change it so we can continue with the filing. Thank you.",
  "Dome 246",
  "Archived Status",
  "The State of Wyoming allows 2 years to from the Inactive Date ____, to",
  "remedy any delinquencies. This entity has come to the end of its life",
  "cycle and can no longer reinstate. The link to form a new company--",
  "https://orders.bizee.com/form-order-now.php",
  "Voluntarily Dissolved",
  "The company status - Dissolved on _______. The state does not allow a",
  "reinstatement. The link to place an order for a new company is https://orders.bizee.com/form-order-now.php",
  "Different type of",
  "Company,",
  "We do not offer filing for LLP",
  "FQ Dissolved",
  "The Date of Involuntary Dissolution by Court Order or by the SOC is:",
  "______. The state does not allow a reinstatement. The link to place an",
  "order for a new company is https://bizee.com/manage-your-company/foreign-qualification",
  "The company status - Inactive-Revoked on _______. The state does not",
  "allow a reinstatement. The link to place an order for a new company is https://bizee.com/manage-your-company/foreign-qualification",
  "The company status - Inactive - Involuntary on _______. The state does",
  "not allow a reinstatement. The link to place an order for a new",
  "company is https://bizee.com/manage-your-company/foreign-qualification",
  "ND",
  "The company status - Revoked on _______. The state does not allow a",
  "reinstatement. The link to place an order for a new company is https://bizee.com/manage-your-company/foreign-qualification",
  "The company status: Inactive-Dissolved on ______. The state does not",
  "allow a reinstatement. The link to place an order for a new company is https://orders.bizee.com/form-order-now.php",
  "The company status: Inactive, STATEMENT OF DISSOLUTION filed on",
  "________. The state does not allow a reinstatement. The link to place an",
  "order for a new company is https://orders.bizee.com/form-order-now.php",
  "The company status: Dissolved on ________. The state does not allow",
  "a reinstatement. The link to place an order for a new company is https://orders.bizee.com/form-order-now.php",
  "The company status: Inactive, DISSOLUTION filed on ________. The",
  "state does not allow a reinstatement. The link to place an order for a",
  "new company is - https://orders.bizee.com/form-order-now.php",
  "The company status: Inactive, Affidavit to Dissolve filed on ________.",
  "The state does not allow a reinstatement. The link to place an order for",
  "a new company is - https://orders.bizee.com/form-order-now.php",
  "The company status: Cancellation on ________. The state does not",
  "The company status: Inactive, STATEMENT OF",
  "DISSOLUTION/TERMINATION filed on ________. The state does not",
  "The company status: Term/Cancel on ________. The state does not",
  "The company status: Inactive-Voluntary Dissolution on ______. The",
  "The company status - Voluntary Dissolution on _______. The state",
  "does not allow a reinstatement. The link to place an order for a new",
  "company is - https://orders.bizee.com/form-order-now.php",
  "Inactive Status CORP We do not offer Reinstatement fling service for Corporations in the",
  "state of Massachusetts.",
  "Volntarily Dissolved",
  "The company status: Voluntary Terminated on __________. The state",
  "The company status: Inactive, Statement of Dissolution filed on",
  "Voluntarily Dissolved The company status: Dissolved - Destruction Filing filed on _________.",
  "(more than 120 days) The state does not allow a reinstatement. The link to place an order for",
  "The company status: Inactive-Voluntary on ______. The state does not",
  "The company status: Dead - Certificate of Dissolution filed on",
  "_________. The state does not allow a reinstatement. The link to place",
  "an order for a new company is https://orders.bizee.com/form-order-now.php",
  "The company status: Inactive-Terminated on ______. The state does",
  "The company status - Voluntarily Dissolved on _______. The state",
  "(More than 5 Years",
  "Dissolved)",
  "The company status - Voluntarily Canceled on _______. The state",
  "Inactive Status",
  "The company status - Automatically Canceled on _______. The state",
  "The company Status: Administratively Dissolved on _______. The",
  "company is not allowed to reinstate since it has been more than 5",
  "years from the effective date of the administrative dissolution. The link",
  "to place an order for a new company is",
  "The company status: Terminated on ______. The state does not allow a",
  "The company status: Voluntary Dissolution on __________. The state",
  "The company status: Voluntary Dissolved on ________. The state does",
  "The Company Status: Terminated on ______. The company is not",
  "allowed to reinstate since it was not administratively dissolved. The link",
  "to place an order for a new company is https://orders.bizee.com/form-order-now.php",
  "The company status: FRANCHISE TAX ENDED. The state does not",
  "allow a reinstatement. The link to place an order for a new registration",
  "is https://orders.bizee.com/form-order-now.php",
  "The company status: Inactive - Dissolved on ______. The state does",
  "The company status: Dissolved/Terminated on ________. The state",
  "FTB Suspended",
  "The company current Status: FTB Suspended (Franchise Tax",
  "Outstanding). To Reinstate the company you will have to pay the",
  "Taxes & penalties. Please contact the Franchise Tax Board at the link",
  "provided for further instructions https://www.ftb.ca.gov/help/business/my-business-issuspended.html#:~:text=When%20your%20business%20has%20been,",
  "all%20past%20due%20tax%20balances",
  "Status Terminated",
  "The company status: TERMINATED. The state does not allow a",
  "Email",
  "Order COGS",
  "Hi Shabina,",
  "Could you order the COGS for this company, please?",
  "Certified copy",
  "request",
  "CERTIFIED COPY/CERTIFICATE REQUEST - ________",
  "Hello,",
  "May you please review the request below and provide the",
  "documentation of the company.",
  "Name:",
  "Filing ID:",
  "Please charge the fee to the Account No: 01273",
  "Republic Registered Agent LLC",
  "5830 E 2nd Street, Suite 7000",
  "Casper, WY 82609",
  "Thank you, have a nice day.",
  "DE CERT ART &",
  "AMEND",
  "Can we get the total cost for the Certified Articles, and amendments",
  "for this company, please?",
  "_________",
  "Certified Articles,",
  "amendments and",
  "Can we get the total cost for the COGS, Certified Articles, and",
  "amendments for this company, please?",
  "________",
  "Ghost Order",
  "Please provide the Entity ID Number as it is on your Articles of",
  "Organization/Incorporation in Alabama so that we may file your",
  "documents accordingly.",
  "Please provide the ID Number as it is on your Articles of",
  "Organization/Incorporation in Colorado so that we may file your",
  "Please provide the Business ALEI as it is on your Articles of",
  "Organization/Incorporation in Connecticut so that we may file your",
  "Please provide the DOS ID Number as it is on your Articles of",
  "Organization/Incorporation in New York so that we may file your",
  "Company not Found",
  "Please be advised that we are unable to locate your company in the",
  "Wyoming state site with the name: _______________. Please provide the",
  "Filing ID as it is on your Articles and the company name exactly as",
  "registered in the state so that we may proceed. If the company was",
  "registered in a different state, please advise so that we may cancel and",
  "refund this order and you can place the order in the correct state.",
  "New York state site with the name: _______________. Please provide the",
  "DOS ID Number as it is on your Articles and the company name exactly",
  "as registered in the state so that we may proceed. If the company was",
  "Please provide the Filing ID as it is on your Articles of",
  "Organization/Incorporation in Wyoming so that we may file your",
  "Please provide the Texas SOS File Number as it is on your Articles of",
  "Organization/Incorporation in Texas so that we may file your",
  "Please provide the Control Number as it is on your Articles of",
  "Organization/Incorporation in Georgia so that we may file your",
  "Please provide the Business ID as it is on your Articles of",
  "Organization/Incorporation in New Hampshire so that we may file your",
  "Organization/Incorporation in Massachusetts so that we may file your",
  "Please provide the Charter Number as it is on your Articles of",
  "Organization/Incorporation in Maine so that we may file your",
  "Organization/Incorporation in Louisiana so that we may file your",
  "ALABAMA state site with the name: _______________. Please provide",
  "the Entity ID Number as it is on your Articles and the company name",
  "exactly as registered in the state so that we may proceed. If the",
  "company was registered in a different state, please advise so that we",
  "may cancel and refund this order and you can place the order in the",
  "correct state. Thank you.",
  "Texas state site with the name: _______________. Please provide the",
  "Texas SOS File Number as it is on your Articles and the company name",
  "Georgia state site with the name: _______________. Please provide the",
  "Control Number as it is on your Articles and the company name",
  "Please provide the Entity # as it is on your Articles of",
  "Organization/Incorporation in Alaska so that we may file your",
  "Please provide the Entity ID as it is on your Articles of",
  "Organization/Incorporation in Arizona so that we may file your",
  "Please provide the Filing # as it is on your Articles of",
  "Organization/Incorporation in Arkansas so that we may file your",
  "Organization/Incorporation in Ohio so that we may file your documents",
  "accordingly.",
  "Please provide the File No. as it is on your Articles of",
  "Organization/Incorporation in California so that we may file your",
  "Please provide the File Number as it is on your Articles of",
  "Organization/Incorporation in Hawaii so that we may file your",
  "Please provide the File # as it is on your Articles of",
  "Organization/Incorporation in Idaho so that we may file your",
  "Please provide the Document Number as it is on your Articles of",
  "Organization/Incorporation in Florida so that we may file your",
  "ALASKA state site with the name: _______________. Please provide the",
  "Entity # as it is on your Articles and the company name exactly as",
  "ARIZONA state site with the name: _______________. Please provide the",
  "Entity ID as it is on your Articles and the company name exactly as",
  "ARKANSAS state site with the name: _______________. Please provide",
  "the Filing # as it is on your Articles and the company name exactly as",
  "CALIFORNIA state site with the name: _______________. Please provide",
  "the File No. as it is on your Articles and the company name exactly as",
  "Florida state site with the name: _______________. Please provide the",
  "Document Number as it is on your Articles and the company name",
  "New Jersey state site with the name: _______________. Please provide",
  "the Entity Id Number as it is on your Articles and the company name",
  "Vermont state site with the name: _______________. Please provide the",
  "Business ID as it is on your Articles and the company name exactly as",
  "Missing Initial Report",
  "Please be advised that the Company Status: Non-Compliant for failure",
  "to file the Initial Report in the state of Alaska. Initial Report is due",
  "within the first six months of the company formation date. We can file",
  "the Initial Report on your behalf, you can place an order via Bizee.com https://bizee.com/manage-your-company/annual-report or you can file",
  "the report by yourself. Please advise when the company is in Good",
  "Standing so we can proceed.",
  "Missing Biennial",
  "Report",
  "to file the ______ Biennial Report in the state of Alaska. We can file the",
  "Biennial Report on your behalf, you can place an order via Bizee.com https://bizee.com/manage-your-company/annual-report or you can file",
  "Missing Annual",
  "Please be advised that the Company Status: Pending Inactive as of",
  "______ for failure to file the ____ Annual report in the state of Arizona.",
  "We can file the Annual Report on your behalf, you can place an order",
  "via Bizee.com https://www.bizee.com/manage-your-company/annual-report/ or you",
  "can file the report by yourself. Please advise when the company is",
  "Active so we can proceed.",
  "We are unable to proceed with the order as the Annual Report for",
  "2025 is past due, failure to file can result in administrative dissolution.",
  "via Bizee.com https://bizee.com/manage-your-company/annual-report or you can file",
  "the report yourself. Please advise when the filing is complete so we",
  "can proceed.",
  "Inactive",
  "UNASSIGNED",
  "AGENT",
  "Please be advised that the company status: Inactive for failure to",
  "Maintain a Registered Agent. We can assist with the Reinstatement",
  "filing to restore your Good Standing status in Delaware. The link to",
  "place an order is https://www.bizee.com/reinstatement-order/ or you",
  "can file the reinstatement yourself.",
  "BUNDLE Canceled",
  "by error",
  "Please be advised the “State Filings Bundle” was canceled when the",
  "annual report was canceled. Please place an order for a new “State",
  "Filings Bundle” or we will need the Bizee fee to file the order. The link is",
  "under Recommendations on your Dashboard —",
  "https://orders.bizee.com/dashboard/recommendation. Thank you",
  "Please be advised that the Company Status: REVOKED as of ______, for",
  "failure to file the ____ Annual report in the state of Illinois. We can assist",
  "with the Reinstatement filing to restore your Good Standing status in",
  "Illinois. The link to place an order for the reinstatement is",
  "https://bizee.com/reinstatement-order or you can file the reinstatement",
  "by yourself.",
  "Non Compliant",
  "Annual Report",
  "A recent legislative change in Delaware now prohibits the use of virtual",
  "addresses as the principal business address. Currently, your company",
  "and member/Director address are using our virtual location. To comply",
  "with the new regulation, we kindly request a new physical address for",
  "both your company and members/Directors. You can still utilize the",
  "virtual address for private mail purposes. Please provide the new",
  "physical address at your earliest convenience. The state requires you",
  "to submit an Amended Annual Report to resolve the issue and restore",
  "the company status to good standing.",
  "Not In Good",
  "Standing",
  "Please be advised that the state will not accept the filing because the",
  "company is not in good standing. You may contact the state at (410)",
  "767-1340 for more information. Please advise when we may proceed",
  "with this order. Thank you.",
  "Please be advised that the Company Status: Delinquent as of ______,",
  "for failure to file the ____ Periodic report in the state of Colorado. The",
  "state requires a Statement Curing Delinquency to bring the company to",
  "Good Standing. We can assist with the Reinstatement filing to restore",
  "your Good Standing status in Colorado. The link to place an order to",
  "reinstate the company is https://www.bizee.com/reinstatement-order/ or you can file the",
  "reinstatement by yourself.",
  "Please be advised that the Company Status: Revoked as of ____ . The",
  "state requires you to file a REINSTATEMENT, and all outstanding",
  "Reports. We can assist with the Reinstatement filing to restore your",
  "Good Standing status in the State. The link to place an order for the",
  "reinstatement is https://bizee.com/reinstatement-order or you can file",
  "the reinstatement by yourself.",
  "Please be advised that the Company Status: Admin Diss/Cancel Report for failure to file the ________ Annual Reports in the State of",
  "Missouri. Unfortunately we do not offer Reinstatement fling service in",
  "the state of Missouri. You may contact the State for more information",
  "Please let us know when the company is Active so we can continue.",
  "Please be advised that the Company Status: REVOKED FOR ANNUAL",
  "REPORT as of __________. We can assist with the Reinstatement filing to",
  "restore your Good Standing status in Florida. The link to place an order",
  "for the reinstatement is https://bizee.com/reinstatement-order or you",
  "can file the reinstatement by yourself.",
  "Inactive Status - FQ",
  "Dissolved",
  "Please be advised that the Company Status: Revoked. The state",
  "requires you to file a REINSTATEMENT, and all outstanding Reports. We",
  "can assist with the Reinstatement filing to restore your Good Standing",
  "status in the State. The link to place an order for the reinstatement is",
  "Please be advised that the Company Status: Terminated as of _____,",
  "for failure to file the ____ Annual report in the state of Washington. We",
  "status in Washington. The link to place an order to reinstate the",
  "company is - https://www.bizee.com/reinstatement-order/ or you can",
  "file the reinstatement by yourself.",
  "Please be advised that the company Status: Inactive - Dissolved",
  "(Administrative) - Failure to file - Annual Report Due Date: _______.",
  "Before any filings can be made to the entity, the status must be in",
  "'Active'. Please direct any questions to Business Services at (615) 7412286 or TNSOS.CORPINFO@tn.gov. for instructions on what",
  "documents and fees must be filed in their office in order to reinstate",
  "the entity to active and good standing status as we currently don’t",
  "offer Reinstatement Service in Tennessee. Please let us know when the",
  "company is Active so we can proceed.",
  "Delaware state site with the name: _______________. Please provide the",
  "File Number as it is on your Articles and the company name exactly as",
  "Illinois state site with the name: _______________. Please provide the File",
  "Number as it is on your Articles and the company name exactly as",
  "Wisconsin state site with the name: _______________. Please provide",
  "the Entity ID as it is on your Articles and the company name exactly as",
  "West Virginia state site with the name: _______________. Please provide",
  "the ORG ID as it is on your Articles and the company name exactly as",
  "Washington DC state site with the name: _______________. Please",
  "provide the File # as it is on your Articles and the company name",
  "Washington state site with the name: _______________. Please provide",
  "the UBI Number as it is on your Articles and the company name exactly",
  "Virginia state site with the name: _______________. Please provide the",
  "Entity ID Number as it is on your Articles and the company name",
  "Utah state site with the name: _______________. Please provide the",
  "Entity Number as it is on your Articles and the company name exactly",
  "Tennessee state site with the name: _______________. Please provide",
  "the SOS Control Number as it is on your Articles and the company",
  "name exactly as registered in the state so that we may proceed. If the",
  "South Dakota state site with the name: _______________. Please provide",
  "the Business ID as it is on your Articles and the company name exactly",
  "South Carolina state site with the name: _______________. Please",
  "provide the Filing ID as it is on your Articles and the company name",
  "Rhode Island state site with the name: _______________. Please provide",
  "the ID Number as it is on your Articles and the company name exactly",
  "Pennsylvania state site with the name: _______________. Please provide",
  "the Entity Number as it is on your Articles and the company name",
  "Oregon state site with the name: _______________. Please provide the",
  "Registry Nbr as it is on your Articles and the company name exactly as",
  "Oklahoma state site with the name: _______________. Please provide the",
  "Filing Number as it is on your Articles and the company name exactly",
  "Ohio state site with the name: _______________. Please provide the",
  "North Dakota state site with the name: _______________. Please provide",
  "the SOS Control ID# as it is on your Articles and the company name",
  "North Carolina state site with the name: _______________. Please",
  "provide the SosId as it is on your Articles and the company name",
  "New Mexico state site with the name: _______________. Please provide",
  "the Business ID# as it is on your Articles and the company name",
  "New Hampshire state site with the name: _______________. Please",
  "provide the Business ID as it is on your Articles and the company name",
  "Nevada state site with the name: _______________. Please provide the",
  "Nebraska state site with the name: _______________. Please provide the",
  "Account Number as it is on your Articles and the company name",
  "Montana state site with the name: _______________. Please provide the",
  "Missouri state site with the name: _______________. Please provide the",
  "Charter Number as it is on your Articles and the company name",
  "Mississippi state site with the name: _______________. Please provide",
  "Minnesota state site with the name: _______________. Please provide",
  "the File Number as it is on your Articles and the company name exactly",
  "Michigan state site with the name: _______________. Please provide the",
  "ID Number as it is on your Articles and the company name exactly as",
  "Massachusetts state site with the name: _______________. Please",
  "provide the ID Number as it is on your Articles and the company name",
  "Maryland state site with the name: _______________. Please provide the",
  "Department ID as it is on your Articles and the company name exactly",
  "Maine state site with the name: _______________. Please provide the",
  "Louisiana state site with the name: _______________. Please provide the",
  "Kentucky state site with the name: _______________. Please provide the",
  "Company ID as it is on your Articles and the company name exactly as",
  "Kansas state site with the name: _______________. Please provide the",
  "Iowa state site with the name: _______________. Please provide the",
  "Business No as it is on your Articles and the company name exactly as",
  "Indiana state site with the name: _______________. Please provide the",
  "Business ID Number as it is on your Articles and the company name",
  "Idaho state site with the name: _______________. Please provide the File",
  "# as it is on your Articles and the company name exactly as registered",
  "in the state so that we may proceed. If the company was registered in",
  "a different state, please advise so that we may cancel and refund this",
  "order and you can place the order in the correct state. Thank you.",
  "Hawaii state site with the name: _______________. Please provide the",
  "Connecticut state site with the name: _______________. Please provide",
  "the Business ALEI as it is on your Articles and the company name",
  "Colorado state site with the name: _______________. Please provide the",
  "Please provide the Original copy of the Articles of",
  "Organization/Incorporation and any amendment filed with the state for",
  "______________________, we require these to complete the Order.",
  "Organization/Incorporation in Illinois so that we may file your",
  "Please provide the Business ID Number as it is on your Articles of",
  "Organization/Incorporation in Indiana so that we may file your",
  "Organization/Incorporation in Kansas so that we may file your",
  "Please provide the Business No as it is on your Articles of",
  "Organization/Incorporation in Iowa so that we may file your documents",
  "Please provide the Company ID as it is on your Articles of",
  "Organization/Incorporation in Kentucky so that we may file your",
  "Organization/Incorporation in Minnesota so that we may file your",
  "Organization/Incorporation in Michigan so that we may file your",
  "Please provide the Filing Number as it is on your Articles of",
  "Organization/Incorporation in Montana so that we may file your",
  "Please provide the Account Number as it is on your Articles of",
  "Organization/Incorporation in Nebraska so that we may file your",
  "Please provide the Entity Number as it is on your Articles of",
  "Organization/Incorporation in Nevada so that we may file your",
  "Organization/Incorporation in New Jersey so that we may file your",
  "Please provide the Record # as it is on your Articles of",
  "Organization/Incorporation in New Mexico so that we may file your",
  "Organization/Incorporation in Missouri so that we may file your",
  "Please provide the Department ID Number as it is on your Articles of",
  "Organization/Incorporation in Maryland so that we may file your",
  "Please provide the SosId Number as it is on your Articles of",
  "Organization/Incorporation in North Carolina so that we may file your",
  "Organization/Incorporation in Mississippi so that we may file your",
  "Please provide the SOS Control ID# as it is on your Articles of",
  "Organization/Incorporation in North Dakota so that we may file your",
  "Organization/Incorporation in Oklahoma so that we may file your",
  "Please provide the Registry Nbr as it is on your Articles of",
  "Organization/Incorporation in Oregon so that we may file your",
  "Organization/Incorporation in Pennsylvania so that we may file your",
  "Please provide the Identification Number as it is on your Articles of",
  "Organization/Incorporation in Rhode Island so that we may file your",
  "Please provide the Entity Id assigned by the Secretary of State of",
  "South Carolina so that we may file your documents accordingly.",
  "Please provide the Control # as it is on your Articles of",
  "Organization/Incorporation in Tennessee so that we may file your",
  "Organization/Incorporation in South Dakota so that we may file your",
  "Organization/Incorporation in Utah so that we may file your documents",
  "Organization/Incorporation in Vermont so that we may file your",
  "Organization/Incorporation in Virginia so that we may file your",
  "Please provide the UBI Number as it is on your Articles of",
  "Organization/Incorporation in Washington so that we may file your",
  "Organization/Incorporation in Washington DC so that we may file your",
  "Please provide the ORG ID as it is on your Articles of",
  "Organization/Incorporation in West Virginia so that we may file your",
  "Organization/Incorporation in Wisconsin so that we may file your",
  "Please be advised that the Company Status: FORFEITED for failure to",
  "file the Franchise Tax Report/Public Information Report. We can file the",
  "Franchise Tax Report/Public Information Report on your behalf, you can",
  "place an order via Bizee.com https://www.bizee.com/manage-your-company/annual-report/or you",
  "Report LLC/CORP",
  "Please be advised that the Company Status: Not Current. Before any",
  "filings can be made to the entity, the status must be in 'Good Standing'.",
  "We can file the Franchise Tax Report on your behalf, you can place an",
  "order via Bizee.com https://www.bizee.com/manage-your-company/annual-report/ or you",
  "can file the report by yourself. Please advise when the company is in",
  "Good Standing so we can proceed.",
  "Report NFP",
  "Please be advised that the Company Status: Revoked. Before any",
  "We can file the Annual Reports on your behalf, you can place an order",
  "We are unable to proceed with the order as the Annual Report for ____",
  "is past due, failure to file can result in administrative dissolution. We",
  "can file the Annual Report on your behalf, you can place an order via",
  "Bizee.com - https://bizee.com/manage-your-company/annual-report or",
  "you can file the report by yourself. Please advise when the filing is",
  "completed so we can proceed.",
  "Please be advised that the Company Status: Active - Not Current for",
  "failure to file the _________ Annual Report in the state of North Carolina.",
  "failure to file can result in administrative dissolution. We can file the",
  "Annual Report on your behalf, you can place an order via Bizee.com https://bizee.com/manage-your-company/annual-report or you can file",
  "the report by yourself. Please advise when the filing is completed so",
  "we can proceed.",
  "Please be advised that the Company Status: Active - On Notice for",
  "Please be advised that the Company Status: - Intent To Dissolve, for",
  "failure to file the _________ Annual Report in the state of Mississippi.",
  "We can file the Status Report on your behalf, you can place an order via",
  "Bizee.com https://www.bizee.com/manage-your-company/annual-report/ or you",
  "Missing Status",
  "Report NPC",
  "failure to file the _________ Status Report in the state of Mississippi. We",
  "can file the Status Report on your behalf, you can place an order via",
  "Please be advised that the Company Status: Not In Good Standing",
  "_____ Year Delinquent. Before any filings can be made to the entity, the",
  "status must be 'Active'. We can file the Annual Report on your behalf,",
  "you can place an order via Bizee.com https://www.bizee.com/manage-your-company/annual-report/ or you",
  "We are unable to proceed with the order as the Franchise Tax Report",
  "is outstanding for _______. We can file the Annual Report on your behalf,",
  "can file the report by yourself. Please advise when the filing is",
  "Please be advised that the Company Status: Not in Good Standing ______. Before any filings can be made to the entity, the status must be",
  "Active. We can file the Annual Report on your behalf, you can place an",
  "Please be advised that the Company Status: ADMIN DISSOLUTION",
  "FOR ANNUAL REPORT as of __________. We can assist with the",
  "Reinstatement filing to restore your Good Standing status in Florida.",
  "The link to place an order for the reinstatement is",
  "Inactive Status /",
  "FRANCHISE TAX",
  "INVOLUNTARILY",
  "ENDED",
  "Please be advised that the Company’s Right to Transact Business in",
  "Texas has been INVOLUNTARILY ENDED For FAILURE TO FILE THE",
  "ANNUAL FRANCHISE TAX REPORT in the state of Texas. The state",
  "requires the company to file all outstanding Franchise Tax Reports and",
  "a Reinstatement after obtaining a Tax clearance from the Comptroller.",
  "We can assist with the Reinstatement filing to restore your Good",
  "Standing status in Texas. The link to place an order for the",
  "reinstatement is https://www.bizee.com/reinstatement-order or you",
  "Inactive Status / For",
  "no Registered Agent",
  "Please be advised we are unable to proceed as the Company Status:",
  "Inactive - Administratively Dissolved (No Agent) on _____ in the State",
  "of Wyoming for failure to maintain the Registered Agent address. The",
  "state requires you to file a REINSTATEMENT, pay the penalty for not",
  "maintaining a Registered agent and submit a change of Agent. We can",
  "assist with the Reinstatement filing to restore your Good Standing",
  "status in Wyoming. The link to place an order is",
  "https://www.bizee.com/reinstatement-order/or you can file the",
  "Please be advised that the Company Status: Inactive Administratively Dissolved (Tax) on ______ in the State of Wyoming for",
  "failure to file the ____ Annual Report. The state requires you to file a",
  "REINSTATEMENT, and all outstanding Annual Reports. We can assist",
  "Wyoming. The link to place an order is",
  "/ FRANCHISE TAX",
  "Texas has been INVOLUNTARILY ENDED For FAILURE TO MAINTAIN A",
  "REGISTERED AGENT in the state of Texas. The state requires the",
  "company to file all outstanding Franchise Tax Reports and submit a",
  "change of Agent, and submit a Reinstatement after obtaining a Tax",
  "clearance from the Comptroller. We can assist with the Reinstatement",
  "filing to restore your Good Standing status in Texas. The link to place",
  "an order for the reinstatement is",
  "https://www.bizee.com/reinstatement-order or you can file the",
  "Please be advised we are unable to proceed as the company filed a",
  "Dissolution on ________. The state will require Franchise Tax fees and",
  "the Revival fees to overturn the company Dissolution. We can assist",
  "Delaware. The link to place an order is",
  "https://bizee.com/reinstatement-order",
  "Please be advised we are unable to proceed as the company status is",
  "Voluntarily Dissolved as of ________. The state requires to file the",
  "Articles of Reinstatement to bring the company to Good Standing. We",
  "status in Colorado. The link to place an order is",
  "Please be advised we are unable to proceed as the Company Status is",
  "DISSOLVED as of _________. The state requires to file a Combined",
  "Certificate of Reinstatement and Annual Report to Activate the",
  "company. We can assist with the Reinstatement filing to restore your",
  "Good Standing status in Connecticut. The link to place an order is",
  "https://www.bizee.com/reinstatement-order/",
  "DISSOLVED as of _________. The state requires to file a Revocation of",
  "the Dissolution to bring the company to Good Standing. We can assist",
  "Mississippi. The link to place an order is",
  "Overdue Tax, Penalty We are unable to proceed as the Company has an unresolved Overdue",
  "and Interest",
  "Tax, Penalty and Interest of $_______. The state needs a Copy of the",
  "Federal Tax Return for ______ to verify assets of the company. The state",
  "needs to review the documents so they can make the",
  "adjustments/resolve issues with the Overdue Tax that is showing the",
  "State Site. Please provide 1. US form 1120 for the _____ tax year signed",
  "by the officer or include e file signature page 2. The Sch L page.",
  "Missing SOI",
  "Please be advised that the Company Status: INACTIVE - SOS",
  "Suspended for failure to file the ____ Statement of Information. We can",
  "file the SOI on your behalf, you can place an order via Bizee.com https://www.bizee.com/manage-your-company/annual-report/ or you",
  "Missing Periodic",
  "Please be advised that the Company Status: Noncompliant for failure",
  "to file the ____ Periodic Report in the state of Colorado. We can file the",
  "Periodic Report on your behalf, you can place an order via Bizee.com https://www.bizee.com/manage-your-company/annual-report/ or you",
  "CORPS/NPC",
  "We are unable to proceed with the order as the Initial Report is past",
  "due. Initial Report is due within the first 30 days of the company",
  "formation date. Failure to file can result in administrative dissolution.",
  "We can file the Initial Report on your behalf, you can place an order via",
  "due. Initial Report is due within the first 90 days of the company",
  "Missing Business",
  "Entity Report",
  "Please be advised that the Company Status: Past Due for failure to file",
  "the ____ Business Entity Report in the state of Indiana. We can file the",
  "Business Entity Report on your behalf, you can place an order via",
  "Bizee.com - https://bizee.com/manage-your-company/annual-report-1",
  "or you can file the report by yourself. Please advise when the company",
  "is Active so we can proceed.",
  "Please be advised we are unable to complete the order as the",
  "Company Status - Pending Admin Dissolution, for Failure to file the",
  "____ Annual Report in the State of Indiana. We can file the Annual",
  "Report on your behalf, you can place an order via Bizeee.com https://www.bizee.com/manage-your-company/annual-report/ or you",
  "can file the report yourself. Please advise when the filing is complete",
  "so we can proceed.",
  "We are unable to proceed with the order as the Biennial Report for",
  "2025 is past due, failure to file within 60 days following your due date",
  "can result in administrative dissolution. We can file the Biennial Report",
  "on your behalf, you can place an order via Bizee.com https://bizee.com/manage-your-company/annual-report or you can file",
  "Missing Information",
  "We are unable to proceed with the order as the Information Report for",
  "We can file the Information Report on your behalf, you can place an",
  "order via Bizee.com https://bizee.com/manage-your-company/annual-report or you can file",
  "Please be advised that the Company Status: Not In Good Standing for",
  "failure to file the ____ Annual Report. We can file the Annual Report on",
  "your behalf, you can place an order via Bizee.com https://bizee.com/manage-your-company/annual-report-1 or you can",
  "file the report by yourself. Please advise when the company is Active",
  "Reports",
  "We are unable to proceed with the order as the Annual Reports for",
  "____ & ____ are past due, failure to file can result in administrative",
  "dissolution. We can file the Annual Reports on your behalf, you can",
  "place an order via Bizee.com https://bizee.com/manage-your-company/annual-report or you can file",
  "Statements LLC",
  "We are unable to proceed with the order as the Annual Statements for",
  "dissolution. We can file the Annual Statements on your behalf, you can",
  "Registration Report",
  "CORPS",
  "We are unable to proceed with the order as the Annual Registration",
  "Report for 2025 is past due, failure to file can result in administrative",
  "dissolution. We can file the Annual Registration Report on your behalf,",
  "you can place an order via Bizee.com https://bizee.com/manage-your-company/annual-report or you can file",
  "Report LLC/NPC",
  "2025 is past due, failure to file before June 2nd can result in",
  "administrative dissolution. We can file the Biennial Report on your",
  "behalf, you can place an order via Bizee.com https://bizee.com/manage-your-company/annual-report or you can file",
  "Report CORP",
  "2025 is past due, failure to file before April 15th can result in",
  "Missing Annual List",
  "Please be advised that the Company Status: Default for failure to file",
  "the ____ Annual List in the state of Nevada. We can file the Annual List",
  "on your behalf, you can place an order via Bizee.com https://www.bizee.com/manage-your-company/annual-report/ or you",
  "We can file the Biennial Report on your behalf, you can place an order",
  "Certificate",
  "We are unable to proceed with the order as the Annual Certificate for",
  "We can file the Annual Certificate on your behalf, you can place an",
  "Missing Renewal",
  "We are unable to proceed with the order as the Renewal for 2025 is",
  "past due, failure to file can result in administrative dissolution. We can",
  "file the Renewal on your behalf, you can place an order via Bizee.com https://bizee.com/manage-your-company/annual-report or you can file",
  "Missing Registration",
  "Fee LLC",
  "We are unable to proceed with the order as the Registration Fee for",
  "2025 is past due, failure to file After 90 days of the due date can result",
  "in administrative dissolution. We can file the Registration Fee on your",
  "Fee/Annual Report",
  "We are unable to proceed with the order as the Registration",
  "Fee/Annual Report for 2025 is past due, failure to file After 90 days of",
  "the due date can result in administrative dissolution. We can file the",
  "Registration Fee/Annual Report on your behalf, you can place an order",
  "due. Failure to file can result in administrative dissolution. We can file",
  "Please be advised that the Company Status: Delinquent as ____ & ____",
  "Annual Reports are past due, failure to file can result in administrative",
  "Please be advised that the Company Status: Not in compliance for",
  "your behalf, you can place an order via bizee.com https://www.bizee.com/manage-your-company/annual-report/ or you",
  "complete so we can proceed.",
  "Please be advised that the Company Status: Admin. Dissolved as of",
  "_______, for failure to file the ______ Annual report in the state of",
  "Georgia. We can assist with the Reinstatement filing to restore your",
  "Good Standing status in Georgia. The link to place an order for the",
  "Inactive Status - RI",
  "comply with annual Franchise Tax Deadlines. Payment of tax does not",
  "restore the entity to good standing. The state requires payment of all",
  "outstanding Franchise tax fees, and file a Statement of Revival to",
  "qualify for a reinstatement. Additional fees would be required to",
  "process the Reinstatement. We can assist with the Reinstatement filing",
  "to restore your Good Standing status in Delaware. The link to place an",
  "order is https://www.bizee.com/reinstatement-order/ or you can file the",
  "reinstatement yourself.",
  "Please be advised that the Company Status: INVOLUNTARY",
  "DISSOLUTION as of ______, for failure to file the ____ Annual report in",
  "the state of Illinois. We can assist with the Reinstatement filing to",
  "restore your Good Standing status in Illinois. The link to place an order",
  "Please be advised that the Company Status: Forfeited - Certificate of",
  "Dissolution/Revocation was filed on: _________To reinstate the state",
  "requires us to file a Combined Certificate of Reinstatement and Annual",
  "Report. We can assist with the Reinstatement filing to restore your",
  "https://www.bizee.com/reinstatement-order/ or you can file the",
  "Please be advised that the Company Status: Inv. Dissolved as of",
  "_______. To reinstate the company you will have to contact the State at",
  "(808) 586-2727 as we currently don’t offer Reinstatement Service in",
  "Hawaii. Please let us know when the Company is Active so we can",
  "Please be advised that the Company Status: - Inactive-Dissolved",
  "(Administrative) as of _________ for failure to file the Annual Report in",
  "the state of Idaho. We can assist with the Reinstatement filing to",
  "restore your Good Standing status in Idaho. The link to place an order",
  "for the reinstatement is https://www.bizee.com/reinstatement-order/",
  "or you can file the reinstatement by yourself.",
  "Please be advised that the Company Status: Admin Dissolved for",
  "failure to file the _________ Annual Reports in the State of Indina.",
  "Unfortunately we do not offer Reinstatement fling service in the state",
  "of Indiana. You may contact the State for more information at (317)",
  "232-6576. Please let us know when the company is Active so we can",
  "Please be advised that the Company Status: - INACTIVE on ________ in",
  "the State of Iowa for failure to file the ____ Biennial Report. The state",
  "requires you to file a REINSTATEMENT, and all outstanding Biennial",
  "Good Standing status in Iowa. The link to place an order is",
  "Please be advised that the Company Status: - Forfeited - Failed to",
  "Timely File I/R on _________ in the State of Kansas for failure to file the",
  "________ Information Report. The state requires you to file a",
  "REINSTATEMENT, We can assist with the Reinstatement filing to",
  "restore your Active and in Good Standing status in Kansas The link to",
  "Please be advised that the Company Status: - Inactive due as of",
  "________, for failure to file the _________ Annual Report in the state of",
  "Kentucky. We can assist with the Reinstatement filing to restore your",
  "Good Standing status in Kentucky. The link to place an order is",
  "Please be advised that the Company Status - Inactive due as of",
  "________, for failure to file the ________ Annual Report in the state of",
  "Louisiana. We can assist with the Reinstatement filing to restore your",
  "Good Standing status in Louisiana. The link to place an order for the",
  "reinstatement is https://www.bizee.com/reinstatement-order/ or you",
  "Please be advised that the Company Status: Involuntary Dissolution",
  "by Court Order or by the SOC as of ________, for failure to file the",
  "________ Annual report in the state of Massachusetts. We can assist",
  "Massachusetts. The link to place an order for the reinstatement is",
  "Inactive Status - not",
  "in good standing Missing AR",
  "Please be advised that the Company Status: In Existence But Not In",
  "Good Standing: for failure to file the ________ Annual Report in the",
  "State of Michigan. We can assist with the Reinstatement filing to",
  "restore your Good Standing status in Michigan. The link to place an",
  "order for the reinstatement is https://bizee.com/reinstatement-order or",
  "you can file the reinstatement by yourself.",
  "Please be advised that the Company Status: Administrative",
  "Termination - for failure to file the _________ Annual report on time in",
  "Minnesota. We can assist with the Reinstatement filing to restore your",
  "Good Standing status in Minnesota. The link to place an order is",
  "Please be advised that the Company Status: - Dissolved, for failure to",
  "file the _________ Annual report in the state of Mississippi. We can",
  "status in Mississippi. The link to place an order for the reinstatement is",
  "for failure to file the ________ Annual Reports in the State of Montana.",
  "We can assist with the Reinstatement filing to restore your Active-Good",
  "Standing status in Montana. The link to place an order for the",
  "reinstatement is https://www.incfile.com/reinstatement-order/ or you",
  "Please be advised that the Company Status: Inactive for failure to file",
  "the ________ Annual Report in the State of Nebraska. We can assist",
  "with the Reinstatement filing to restore your Active status in Nebraska.",
  "https://www.incfile.com/reinstatement-order/ or you can file the",
  "Please be advised that the Company Status: Revoked for failure to file",
  "the _________ Annual Report in the State of Nevada We can assist with",
  "the Reinstatement filing to restore your Active status in Nevada. The",
  "link to place an order for the reinstatement is",
  "Please be advised that the Company Status: Administratively",
  "Dissolved for failure to file the __________ Annual Report in the State of",
  "New Hampshire We can assist with the Reinstatement filing to restore",
  "your Good Standing status in New Hampshire. The link to place an",
  "order for the reinstatement is",
  "https://bizee.com/business-management/reinstatement?",
  "redirect=fromIncfile",
  "Please be advised that the Company Status: Revoked - for failure to",
  "file the __________ Annual Reports. The state requires you to file a",
  "REINSTATEMENT and all outstanding Annual Reports. We can assist",
  "New Jersey. The link to place an order is",
  "Please be advised that the Company Status: Admin. Dissolved for",
  "failure to file the _________ Annual reports in the state of North",
  "Carolina. We can assist with the Reinstatement filing to restore your",
  "Good Standing status in North Carolina. The link to place an order for",
  "the reinstatement is https://www.bizee.com/reinstatement-order/ or",
  "Please be advised that the Company Status: Inactive - Involuntary for",
  "failure to file the _________ Annual report in the state of North Dakota.",
  "We can assist with the Reinstatement filing to restore your Active",
  "status in North Dakota. The link to place an order for the reinstatement",
  "is https://www.bizee.com/reinstatement-order/ or you can file the",
  "Company Status - Revoked as of _______. To reinstate the company",
  "you will have to contact the State at (401)-222-3040 as we currently",
  "don’t offer Reinstatement Service in Rhode Island. Please let us know",
  "when the Company is Active so we can proceed.",
  "Please be advised that the Company Status: Cancelled and a",
  "Reinstatement is needed. Unfortunately we do not offer Reinstatement",
  "fling service in the state of Ohio. You may contact the State for more",
  "information. Please let us know when the company is Active so we can",
  "the ________ Annual certificate in the state of Oklahoma. We can assist",
  "with the Reinstatement filing to restore your Active status in Oklahoma.",
  "________ for failure to file the Annual Report in the state of Oregon. We",
  "status in Oregon. The link to place an order for the reinstatement is",
  "Please be advised that the Company Status: Inactive as of ________ for",
  "Failure to File Renewal. We can assist with the Reinstatement filing to",
  "restore your Good Standing status in Utah. The link to place an order",
  "for the reinstatement is https://www.incfile.com/reinstatement-order/",
  "Please be advised that the Company Status: Terminated as of",
  "________, for failure to file the ________ Annual report on time in the state",
  "of Vermont. We can assist with the Reinstatement filing to restore your",
  "Active status in Vermont. The link to place an order to reinstate the",
  "Please be advised that the Company Status: Inactive as of ________, for failure to file the Annual report on time in Virginia. We can assist",
  "with the Reinstatement filing to restore your Active status in Virginia.",
  "Dissolved as of ________, for failure to file the ________ Annual report in",
  "the state of Washington. We can assist with the Reinstatement filing to",
  "restore your Active status in Washington. The link to place an order to",
  "Please be advised that the Company Status: Revoked (Failure to File",
  "Annual Report) and a Reinstatement is needed. Unfortunately we do",
  "not offer Reinstatement fling service in the state of West Virginia . You",
  "may contact the State for more information. Please let us know when",
  "the company is active so we can continue. Thank you.",
  "Dissolved as of ______, for failure to file the ____ Annual report in the",
  "state of Wisconsin. We can assist with the Reinstatement filing to",
  "restore your Good Standing status in Wisconsin. The link to place an",
  "order to reinstate the company is https://www.bizee.com/reinstatement-order/ or you can file the",
  "DISSOLVED as of _________. The state requires to file a Revival to",
  "Activate your Company. We can assist with the Reinstatement filing to",
  "restore your Good Standing status in Nevada. The link to place an",
  "order is https://www.bizee.com/reinstatement-order/",
  "(within 120 days)",
  "DISSOLVED - Destruction Filing filed _________. The state requires to",
  "file a Revocation of Dissolution within 120 days of voluntary dissolution",
  "filing. We can assist with the Reinstatement filing to restore your Good",
  "Standing status in North Carolina ***DEADLINE _____***. The link to",
  "place an order is https://www.bizee.com/reinstatement-order/",
  "Voluntarily Canceled as of ________. The state requires to file the",
  "Articles of Reinstatement to reactivate your company. We can assist",
  "Virginia. The link to place an order is",
  "FQ",
  "142",
  "Inactive Status for",
  "CORP and NFP",
  "Dissolved as of _______. To reinstate the company you will have to",
  "contact the State at (207) 624-7736 as we currently don’t offer",
  "Reinstatement Service in Maine. Please let us know when the Company",
  "Please be advised that the Company Status: Admin Dissolution as of",
  "______, for failure to file the ____ Biennial report in the state of Alaska.",
  "The state requires all the Biennial Reports due to bring the company to",
  "your Good Standing status in Alaska. The link to place an order to",
  "Open window for AR",
  "Please be advised that the State is requesting to file the 2025",
  "Franchise Tax Report before any filling can be submitted. We can file",
  "the Report on your behalf, you can place an order via Bizee.com https://www.bizee.com/manage-your-company/annual-report/ or you",
  "can file the report yourself. Please advise when the report is complete",
  "Additional Funds",
  "Cetified Articles and",
  "Amendments",
  "Fees to order Certified Articles and any Amendment",
  "The State requires both the Certified Articles and any amendment, and",
  "the Certificate of Good Standing for filing a Foreign Qualification. The",
  "additional fee for ordering Certified Copies from the state of ___ is $.00",
  "Certified Articles and Fee to order Certified Articles and any Amendment",
  "The state of Illinois requires both the Certified Articles and any",
  "amendment for filing a Foreign Qualification. The additional fee to order",
  "the Certified Copies from the state of _____ is $00.",
  "Name not Available",
  "Fee To File an Assumed Name.",
  "The State requires the Certified Articles and any amendment for filing a",
  "Foreign Qualification. The additional fee for ordering Certified Copies",
  "from the state of ___ is $.00",
  "The company name is unavailable, the state of Illinois requires us to file",
  "an Application to Adopt an Assumed Name. The additional funds to",
  "submit the Application is $__.00",
  "60 Fee To File A Fictitious Name",
  "The company name is unavailable, the state of Wyoming requires us to",
  "file a Use of Fictitious Name form. The additional funds to submit the",
  "Fictitious Name is $60.00.",
  "Fee to File a Trade Name",
  "The company name is unavailable, the state of Hawaii requires us to",
  "file an Application for Registration of Trade Name to transact business",
  "in Hawaii. The additional funds to submit the Trade Name is $___.00.",
  "Fee To File A Forced DBA Registration.",
  "The company name is unavailable, the state of New Hampshire",
  "requires us to file a Statement of Forced DBA Registration. Please",
  "provide a Trade Name to adopt for the purpose of transacting business",
  "in New Hampshire. The additional funds to submit the Trade Name is",
  "$___.00.",
  "Fee To File A Fictitious Name",
  "The company name is unavailable, the state of Maine requires us to file",
  "a Statement of Business Under a Fictitious Name. Please provide a",
  "Fictitious Name to adopt for the purpose of transacting business in",
  "Maine. The additional funds to submit the Fictitious Name is $___.00",
  "The company name is unavailable, the state of South Carolina requires",
  "us to file a Form adopting a Fictitious name. The additional funds to",
  "submit the Fictitious Name is $__.00.",
  "Invalid Designator",
  "Be advised that the designator __ is invalid in South Carolina. The state",
  "requires us to file a Form adopting a Fictitious name. The additional",
  "funds to submit the Fictitious Name is $__.00.",
  "Wrong order",
  "You already formed a Foreign Qualification in the state of __ (ID: ___ ).",
  "Please advise if you want to file a different document for this company,",
  "so we can cancel and refund this order and you can place the right",
  "order.",
  "We don’t file FQ",
  "The information required by the state is beyond the scope of our filing.",
  "This is not a FQ",
  "Foreign qualification is the process of registering to do business in a",
  "state other than the one in which you incorporated or formed your",
  "business. The state of formation on the order is _____ which is also a",
  "Foreign Qualification. Please place an order with the correct details so",
  "we can assist with the filing. Thank you",
  "Wrong State of",
  "Formation",
  "The company state of formation is ______, not ______. We request that",
  "you place a new order with the correct information",
  "https://bizee.com/manage-your-company/foreign-qualification",
  "Email to Submit",
  "Please file this Foreign Qualification EXPEDITED ( $100 FEE)",
  "Agent Info:",
  "Email to Fax",
  "Please fax",
  "Request Shares Info",
  "Please fill out the attached form, as required by the State.",
  "RA Acceptance",
  "Please have the Registered Agent sign the attached acceptance form",
  "as required by the State of Florida.",
  "Point 8",
  "The corporation cannot qualify to transact business with a zero Illinois",
  "tax factor. The form can not have 0 on the 9), 10(a), and 10(c). For the",
  "10(d) the state requires at least $1. 10(b) cannot exceed item 10(a) and",
  "10(d) cannot exceed item 10(c) - Otherwise will be rejected.",
  "IL CORP FQ",
  "Submit in duplicate",
  "Please attach a prepaid self-addressed envelope",
  "Please sign President: __",
  "Check $150",
  "IL FQ",
  "Please sign (Member/Manager): __",
  "IL CORP FQ ABN",
  "Could you please sign pages 2 and 3:",
  "1. President: __",
  "2. Please send a check for $__",
  "$150 + $__ (Application for Admission + Application to Adopt an",
  "Assumed Name)",
  "3. Submit in duplicate",
  "4. Please attach a prepaid self-addressed envelope",
  "IL ABN FQ",
  "Please sign pages 2 and 3 Member: __",
  "Check $150 + $__ (Application for Admission + Application to Adopt an",
  "HELP",
  "Please read this information that could help you:",
  "PAID-IN CAPITAL: Paid-in capital is the amount of money or other",
  "property paid to the corporation for, or on account of, the issued",
  "shares, less expenses incurred with the issuance of shares, plus any",
  "cash or other consideration contributed to the corporation. The amount",
  "of paid-in capital can never be $0, as there must always be at least one",
  "issued share.",
  "*PROPERTY: For the purpose of computing franchise tax, property",
  "means gross assets of the corporation — real, personal, tangible,",
  "intangible, or mixed — without qualification.",
  "*BUSINESS: For the purpose of computing franchise tax, business",
  "means gross revenues of the corporation from whatever source",
  "derived.",
  "If you still have concerns please consult your business accountant or",
  "CPA to clarify this information as we do not provide this type of",
  "assistance.",
  "I hope you find this helpful,",
  "Regards,",
  "RA Address, CMRA",
  "The Registered Agent address cannot be a Commercial Mail Receiving",
  "Agency. Please provide a physical address where you will be available",
  "to receive a Service of Process during Business hours.",
  "Commercial Registered Office Provider. Once we receive this, then we",
  "can continue with your filing. Thank you.",
  "be listed as a Service Company in the State of Louisiana. Please",
  "provide an agent as a person or a Service Company authorized to act",
  "as a Registered Agent in the State.",
  "EIN/FEIN",
  "Please provide the EIN number for your company. We need this",
  "information to continue with the Foreign Qualification, if you don't have",
  "it, you can place an order via",
  "https://bizee.com/manage-your-company/tax-id-ein",
  "The company name is unavailable, please provide a fictitious company",
  "name to transact business in Alabama.",
  "The company name is unavailable, please provide an Alternative Name",
  "adopted for the purpose of transacting business in Minnesota",
  "The company name is unavailable, please provide a Trade Name for",
  "the purpose of transacting business in New Hampshire.",
  "The company name is unavailable, please provide an ABN for the",
  "purpose of transacting business in Nevada.",
  "The company name is unavailable, please provide an Assumed Name",
  "to transact business in Delaware.",
  "The company name is unavailable, please provide a Fictitious name to",
  "transact business in New York.",
  "The company name is unavailable, please provide a Fictitious Name to",
  "transact business in Wyoming.",
  "to adopt to transacting business in Michigan.",
  "The company name is unavailable, please provide a fictitious name for",
  "the purpose of transacting business in Wisconsin.",
  "The company name is unavailable, please provide a DBA Name for the",
  "purpose of transacting business in Washington.",
  "https://bizee.com/form/virtual-mailbox.",
  "The new company name is unavailable, please provide 3 alternate",
  "company names to transact business in ___",
  "Designator LLC",
  "Please be advised every company must have a Designator (LLC,",
  "Limited Liability Company, L.L.C.) If you want, you can place an order",
  "for a Fictitious name or DBA, and we can cancel and refund this order.",
  "Here's the link https://bizee.com/file-dba Or you can contact us in case",
  "you have any additional questions regarding this order. Thank you.",
  "Please provide the name of the Authorized Representative to sign on",
  "behalf of _______",
  "Show 22 more",
  "Issued Shares",
  "Please provide the number of Issued Shares (Common/Preferred or",
  "both)",
  "To proceed with the Foreign Qualification we need additional",
  "Information. Let us know if you want to proceed so we can send you a",
  "Stock Information form.",
  "Wisconsin Capital Information form.",
  "Company Registered",
  "as DLLC",
  "Please be advised that the company ______ is already registered in __, if",
  "you want to register this company as a foreign qualification, you may",
  "need whether to dissolve the domestic registration first, so we can",
  "proceed with this order or you can contact the __ state and follow their",
  "steps to do a conversion. Please advise how to proceed.",
  "Active Name",
  "Registration LLC",
  "Please be advised that there is an active Foreign LLC Name",
  "Registration applied by ____. If you want to proceed with the Foreign",
  "Qualification the Name Registration must be canceled. Please advise",
  "when the cancelation is finished, so we can proceed.",
  "Registration CORP",
  "Please be advised that there is an active Foreign CORPORATION",
  "Name Registration applied by ____. If you want to proceed with the",
  "Foreign Qualification the Name Registration must be canceled. Please",
  "advise when the cancelation is finished, so we can proceed.",
  "FQ Already filed but",
  "in Bad Standing",
  "Please be advised that the company ___ is already registered in __ as a",
  "foreign company. This entity is on ____ status since it has penalties",
  "Unpaid or the Annual Report is Past Due. We can cancel this order and",
  "file the Annual Report on your behalf, you can place an order via",
  "you can file the report yourself.",
  "PURPOSE Specific",
  "Your purpose implies that you are trying to file a Professional LLC, and",
  "those types of fillings require a license. If you are not providing",
  "professional services, rephrase your company’s purpose, please be",
  "more specific. If you provide Professional services, we can cancel and",
  "refund your order because Bizee.com does not currently file",
  "Professional LLCs",
  "As required by the state of Delaware:",
  "Assets and Liabilities",
  "Please provide the assets $______ and Liabilities $______ of the",
  "company.",
  "The assets and liabilities required are as of a date within six months.",
  "Information sent",
  "from mfile",
  "We have sent you an email directly from mfile@incfile.com requesting",
  "additional information required to process the filing.",
  "Sole member is an",
  "Entity",
  "Please be advised that the state of Arkansas requires at least one",
  "individual acting as an Incorporator/Organizer of the company. Please",
  "provide the name and address of an individual.",
  "Missing Par Value",
  "Please provide the Par Value of each Share, as requested by the State",
  "of ________.",
  "The RA info is the",
  "Please provide the name and address of a member or other person,",
  "same as the Member different from the Registered Agent, to whom the administrator is to",
  "send copies of any process served on the administrator, as required by",
  "the State.",
  "RA Individual",
  "Please provide **1. The Email address of the Registered Agent ** 2.",
  "The phone number of the Registered Agent.",
  "Be advised that the designator __ is invalid in the state of New York.",
  "Please choose one of these designators to use in New York:",
  "Corporation, Corp., Limited, Ltd., Incorporated, Inc.",
  "Please choose one of these designators to use after the company",
  "name “_____“ in South Carolina: Limited Liability Company, Limited",
  "Company, LLC, LC, Ltd Co, LTD Liability Co.",
  "Designator CORP",
  "Please be advised every company must have a Designator (CORP.,",
  "INC., Corporation, Company) If you want, you can place an order for a",
  "Fictitious name or DBA, and we can cancel and refund this order.",
  "NFP Directors",
  "Please be advised that a non-profit corporation must have 3 directors",
  "at all times.",
  "Registered Agent",
  "Acceptance",
  "Please be advised the State of Connecticut requires the Registered",
  "Agent to sign an acceptance form. The request is sent by email to the",
  "Agent and requires them to sign within 72 hours. The State will reject",
  "the filing if the acceptance is not signed. Please provide the Agent's",
  "Authorized Person name.",
  "Please be advised that if you want to use a Company as Agent it must",
  "be Registered as a California Registered Corporate Agent (1505).",
  "Please provide a 1505 Company or an individual information instead.",
  "Officers info missing",
  "Please provide the officers’ name and address (President, Secretary,",
  "and Treasurer).",
  "Ghost Order,",
  "President",
  "confirmation",
  "Please provide the name of the President authorizing this filing",
  "County request",
  "Please provide the county within New York State in which the office of",
  "the foreign limited liability company is to be located or if the foreign",
  "limited liability company shall maintain more than one office in this",
  "state, the county within New York State in which the principal office of",
  "the foreign limited liability company is to be located.",
  "Rejection Deadline",
  "Ending",
  "Please reply to this email within 10 days to avoid additional fees for a",
  "new filing.",
  "Same person",
  "Please be advised that the Arizona State will not accept the",
  "Registered Agent and Member address to be different since is the",
  "same person. Please advise which address will be used.",
  "CORP Pobox",
  "Purpose Missing",
  "Please provide a purpose, where you describe the company's",
  "economic activity.",
  "Address POBOX",
  "that there is an active Trade Name for this company name. This Trade",
  "Name is holding the rights of the name for 5 years, if it’s yours and you",
  "wish to use this name, you would need to cancel the Trade name. But if",
  "it is not your Trade Name, please provide an Assumed Name to adopt",
  "to transact business in Alaska.",
  "The company name is unavailable, please provide a Desired Modified",
  "Name adopted for the purpose of transacting business in Washington",
  "DC.",
  "The company name is unavailable, please provide an Alternate",
  "Company Name to transact business in California.",
  "transact business in Arizona.",
  "The company name is unavailable, please provide a Designated Name",
  "to transact business in Arkansas.",
  "Company name to transact business in Florida.",
  "Company name to transact business in Georgia.",
  "to transact business in Texas.",
  "to transact business in Ohio.",
  "registration, please provide an Assumed Name to adopt to transact",
  "business in Alaska. The second option is that you submit a cancellation",
  "of the name reservation to the state and then we can proceed with the",
  "online filing. Please review and advise. Thank you",
  "Ownership",
  "Percentages Missing",
  "Please provide the Member ownership Percentage for - Member 1. ___",
  "Member 2. ___ as required by the state.",
  "Manager Managed",
  "If the LLC is managed by managers, there must be at least one",
  "member and one manager, in addition, list the name, address, and",
  "percentage held of each person/entity owning at least 5% of the",
  "company. Please provide the name of the managers and members you",
  "wish to list and the percentage of ownership.",
  "to transact business in Illinois.",
  "The company name is unavailable, please provide an Assumed Entity",
  "Name adopted for the purpose of transacting business in Colorado.",
  "The company name is unavailable, please provide a Fictitious name",
  "adopted for the purpose of transacting business in Connecticut.",
  "The company name is unavailable, please provide a Fictitious Name",
  "adopted for the purpose of transacting business in Hawaii.",
  "The company name is unavailable, please provide an DBA for the",
  "purpose of transacting business in Idaho.",
  "Company name to transact business in Indiana.",
  "The company name is unavailable, please provide a Fictitious Name for",
  "the purpose of transacting business in Iowa.",
  "purpose of transacting business in Kansas.",
  "The company name is unavailable, please provide a DBA for the",
  "purpose of transacting business in Kentucky.",
  "purpose of transacting business in Louisiana",
  "the purpose of transacting business in Maine.",
  "for the purpose of transacting business in Maryland.",
  "the purpose to transact business in Massachusetts",
  "Address not in State",
  "our Virtual Address",
  "A recent legislative change in the State now prohibits the use of",
  "virtual addresses as the principal address and/or members’ address.",
  "Currently, your company address is using our virtual location. To",
  "comply with the new regulation, we kindly request a new physical",
  "address for your company. You can still utilize the virtual address for",
  "private mail purposes. Please provide the new physical address at your",
  "earliest convenience. Additionally, let us know if you want to cancel the",
  "Virtual Address service.",
  "Resend doc by issue",
  "Please be advised that a form was sent to the e-mail",
  "JASON.RUSNAK@benevate.com on __/__/____ in order to be filled out",
  "as required by the state of __.",
  "Podiatry and wound care services are considered professional services",
  "in North Carolina. With this purpose we will have to cancel and refund",
  "this order since we do not file professional entities, otherwise, *please",
  "provide a non-professional purpose",
  "Please be advised that we are canceling and refunding your order. The",
  "information of the company that you're trying to file seems to be in the",
  "category of Professional Limited Liability Companies. We have to",
  "inform you that we are not filling Professional companies.",
  "Chang 175",
  "of",
  "Already Updated",
  "The Change of Agent is not required as the information requested is",
  "currently listed on the state.",
  "Wrong State for",
  "Domestic",
  "Your company is Registered in the State of _______ as a Domestic, we",
  "request that you place a new order where the State of Formation is in",
  "_______, not in _______. Thank you.",
  "Foreign",
  "Your company is Registered in the State of _______ as a Foreign, we",
  "Comment",
  "RA Only already in",
  "state",
  "Registered Agent information already active with the state, Shipping",
  "Email Script LLC",
  "Please sign (Member/Manager) - _______",
  "Check for $30",
  "Email RA acceptance Please have the Registered Agent sign the attached acceptance form",
  "as required by the State.",
  "REQ CID/PIN",
  "Request for CID & PIN",
  "ID number:",
  "Summary for:",
  "Email to Submit RA",
  "Only LLC",
  "Hi Shabina",
  "Please sign",
  "Page 2 and 3: Lovette Dobson",
  "Check $5.00",
  "Please mail to SDAT, 301 W. Preston ST, 8th Floor, Baltimore, MD 21201.",
  "Check for $75",
  "Please file this change of Registered Agent Routine",
  "File Number: _____",
  "Name: _______",
  "Registered Agent Info:",
  "Address: _________",
  "Phone Number: _______",
  "Email Address: _________",
  "Email Script CORP",
  "Please sign President - ________",
  "To whom it may concern,",
  "Please Review and Submit the attachment",
  "Best Regards",
  "CORA using our RA",
  "info",
  "If you want to use our Registered Agent for your company, we can offer",
  "you that service. You can find it on our Website",
  "https://bizee.com/form/manage-your-company/registered-agent",
  "otherwise, please provide a new Registered Agent information.",
  "Entity as RA Inactive",
  "If an entity will act as a Registered Agent, it must be active within the",
  "Texas State. The Registered Agent provided _____ is currently Inactive",
  "within the State, we can assist with the Reinstatement for the company",
  "_____ https://www.bizee.com/reinstatement-order or you can file the",
  "reinstatement by yourself. Please let us know how to proceed.",
  "Ghost LLC (Member)",
  "Please provide **1. The Business ID Number as it is on your Articles of",
  "Organization in Indiana. **2. The name of the Member Authorizing this",
  "filing so that we may file your documents accordingly",
  "Ghost CORP",
  "Incorporation in Indiana. **2. The name of the President Authorizing",
  "this filing so that we may file your documents accordingly",
  "Commercial, CROP",
  "No Initial Report",
  "Filed",
  "Please provide 1. The Purpose for your company, be advised that the",
  "State of California only allows 100 characters as the company",
  "purpose. 2. All Members’ names and addresses",
  "commercial, 1505",
  "same person but",
  "different address",
  "Please be advised that the state of Missouri does not allow the",
  "Registered Agent and Member’s Address to de different if it’s the same",
  "person. In order to continue with the Change of Agent with the address",
  "“_______”, you would need to file an amendment first, in order to change",
  "the member's address. You can place an order here",
  "https://bizee.com/form/manage-your-company/amendment Please let",
  "us know how to proceed.",
  "Initials in Agent’s",
  "name",
  "Window Open for AR",
  "Please be advised that the State is requesting to file the 2025 Annual",
  "Report before the change of agent can be submitted. We can file the",
  "Annual Report on your behalf, you can place an order via Bizee.com https://www.bizee.com/manage-your-company/annual-report/ or you",
  "so we can proceed with the registered agent change.",
  "Incorrect State ID",
  "Please be advised that the _____ ID provided (_______) belongs to",
  "_______. Please provide the correct _______ ID in _____.",
  "Member Entity",
  "Please provide the name of the Authorized Agent to sign on behalf of",
  "_______",
  "of the company can be listed instead. Please provide valid entity",
  "Commercial, Service",
  "to act as a Registered Agent in the State. Once we receive this, then",
  "we can continue with your filing. Thank you.",
  "Please provide **1. The Entity ID Number as it is on your Articles of",
  "Organization in Alabama. **2. The name of the Member Authorizing",
  "this filing so that we may file your documents accordingly.",
  "Ghost LLC",
  "Please provide **1. The ID Number as it is on your Articles of",
  "Organization in Massachusetts. **2. The name of the Member",
  "Authorizing this filing so that we may file your documents accordingly.",
  "Incorporation in Massachusetts. **2. The name of the President",
  "Please provide **1. The File # as it is on your Articles of Organization in",
  "Idaho. **2. The name of the Member Authorizing this filing so that we",
  "may file your documents accordingly",
  "Please provide **1. The File # as it is on your Articles of Incorporation in",
  "Idaho. **2. The name of the President Authorizing this filing so that we",
  "Please provide **1. The Filing ID as it is on your Articles of",
  "Incorporation in Wyoming. **2. The name of the President Authorizing",
  "Please provide **1. The Filing ID as it is on your Articles of Organization",
  "in Wyoming. **2. The name of the Member Authorizing this filing so",
  "that we may file your documents accordingly.",
  "Please provide **1. The Texas SOS File Number as it is on your Articles",
  "of Organization in Texas. **2. The name of the Member Authorizing",
  "of Incorporation in Texas. **2. The name of the President Authorizing",
  "(Manager)",
  "of Organization in Texas. **2. The name of the Manager Authorizing",
  "Organization in Colorado. **2. The name of the Member Authorizing",
  "Please provide **1. The Control Number as it is on your Articles of",
  "Organization in Georgia. **2. The name of the Member Authorizing this",
  "Incorporation in Georgia. **2. The name of the President Authorizing",
  "Incorporation in Alabama. **2. The name of the President Authorizing",
  "Please provide **1. The Entity # as it is on your Articles of Organization",
  "in Alaska. **2. The name of the Member Authorizing this filing so that",
  "we may file your documents accordingly.",
  "Password-Protected",
  "Please be advised that the company is password-protected, therefore",
  "we cannot continue unless you provide the permission to make",
  "changes to the company. Please call the Arizona State: (602) 5423026 and request them to provide authorization to the account",
  "\"efile1234@incfile.com”.",
  "Organization/Incorporation and any amendment filed with the state of",
  "______________________, we require these to complete the Change of",
  "Agent.",
  "Please provide **1. The Entity ID as it is on your Articles of",
  "Incorporation in Arizona. **2. The name of the President Authorizing",
  "Please provide **1. The Filing # as it is on your Articles of Incorporation",
  "in Arkansas. **2. The name of the President Authorizing this filing so",
  "that we may file your documents accordingly",
  "Organization in Arizona. **2. The name of the Member Authorizing this",
  "filing so that we may file your documents accordingly.",
  "Organization in Alabama. **2. The name of the Manager Authorizing",
  "in Alaska. **2. The name of the Manager Authorizing this filing so that",
  "Organization in Arizona. **2. The name of the Manager Authorizing",
  "Please provide **1. The Filing # as it is on your Articles of Organization",
  "in Arkansas. **2. The name of the Member Authorizing this filing so",
  "in Arkansas. **2. The name of the Manager Authorizing this filing so",
  "Please provide **1. The DOS ID Number as it is on your Articles of",
  "Organization in New York. **2. The name of the Member Authorizing",
  "Please provide **1. The File No. as it is on your Articles of Organization",
  "in California. **2. The name of the Member Authorizing this filing so",
  "Please provide **1. The File No as it is on your Articles of Organization",
  "in California. **2. The name of the Manager Authorizing this filing so",
  "(Member)",
  "Please provide **1. The Document Number as it is on your Articles of",
  "Organization in Florida. **2. The name of the Member Authorizing this",
  "Organization in Florida. **2. The name of the Manager Authorizing this",
  "Please provide **1. The File No as it is on your Articles of Incorporation",
  "in California. **2. The name of the President Authorizing this filing so",
  "Please provide **1. The Entity # as it is on your Articles of",
  "Incorporation in Alaska. **2. The name of the President Authorizing",
  "Incorporation in Florida. **2. The name of the President Authorizing",
  "Incorporation in New York. **2. The name of the President Authorizing",
  "Please provide **1. The File Number as it is on your Articles of",
  "Organization in Illinois. **2. The name of the Manager Authorizing this",
  "Incorporation in Illinois. **2. The name of the President Authorizing",
  "Incorporation in Delaware. **2. The name of the President Authorizing",
  "Organization in Delaware. **2. The name of the Member Authorizing",
  "Organization in Virginia. **2. The name of the Member Authorizing this",
  "Incorporation in Virginia. **2. The name of the President Authorizing",
  "Organization in Michigan. **2. The name of the Member Authorizing",
  "Incorporation in Michigan. **2. The name of the President Authorizing",
  "Please provide **1. The Business No as it is on your Articles of",
  "Organization in Iowa. **2. The name of the Member Authorizing this",
  "Incorporation in Iowa. **2. The name of the President Authorizing this",
  "Please provide **1. The Department ID as it is on your Articles of",
  "Organization in Maryland. **2. The name of the Member Authorizing",
  "Incorporation in Maryland. **2. The name of the President Authorizing",
  "Please confirm that the ADDRESS “______” is correct. We haven't been",
  "able to find it as you wrote it in the USPS database. Please recheck the",
  "street address, city, and zip code. We found: ____",
  "Organization in Indiana. **2. The name of the Manager Authorizing this",
  "Incorporation in Colorado. **2. The name of the President Authorizing",
  "Please provide **1. The Business ALEI as it is on your Articles of",
  "Organization in Connecticut. **2. The name of the Member",
  "Organization in Connecticut. **2. The name of the President",
  "Organization in Connecticut. **2. The name of the Manager",
  "Organization in Hawaii. **2. The name of the Member Authorizing this",
  "Organization in Hawaii. **2. The name of the Manager Authorizing this",
  "Organization in Hawaii. **2. The name of the President Authorizing",
  "Please provide **1. The Business ID as it is on your Articles of",
  "Organization in Kansas. **2. The name of the Member Authorizing this",
  "Organization in Kansas. **2. The name of the Manager Authorizing this",
  "Organization in Kansas. **2. The name of the President Authorizing",
  "Please provide **1. The Company ID as it is on your Articles of",
  "Organization in Kentucky. **2. The name of the Member Authorizing",
  "Organization in Kentucky. **2. The name of the President Authorizing",
  "Organization in Kentucky. **2. The name of the Manager Authorizing",
  "Please provide **1. The Charter Number as it is on your Articles of",
  "Organization in Louisiana. **2. The name of the Member Authorizing",
  "Organization in Louisiana. **2. The name of the Manager Authorizing",
  "Organization in Louisiana. **2. The name of the President Authorizing",
  "Organization in Maine. **2. The name of the Member Authorizing this",
  "Organization in Maine. **2. The name of the President Authorizing this",
  "Organization in Minnesota. **2. The name of the Member Authorizing",
  "Organization in Minnesota. **2. The name of the Manager Authorizing",
  "Organization in Minnesota. **2. The name of the President Authorizing",
  "Organization in Mississippi. **2. The name of the Member Authorizing",
  "Organization in Mississippi. **2. The name of the Manager Authorizing",
  "Organization in Mississippi. **2. The name of the President",
  "Organization in Missouri. **2. The name of the Manager Authorizing",
  "Organization in Missouri. **2. The name of the Member Authorizing",
  "Organization in Missouri. **2. The name of the President Authorizing",
  "Please provide **1. The Filing Number as it is on your Articles of",
  "Organization in Montana. **2. The name of the Member Authorizing",
  "Organization in Montana. **2. The name of the Manager Authorizing",
  "Organization in Montana. **2. The name of the President Authorizing",
  "Please provide **1. The Account Number as it is on your Articles of",
  "Organization in Nebraska. **2. The name of the Member Authorizing",
  "Organization in Nebraska. **2. The name of the President Authorizing",
  "Please provide **1. The Entity Number as it is on your Articles of",
  "Organization in Nevada. **2. The name of the Managing Member",
  "Organization in Nevada. **2. The name of the President Authorizing",
  "Organization in New Hampshire. **2. The name of the Member",
  "Organization in New Hampshire. **2. The name of the Manager",
  "Organization in New Hampshire. **2. The name of the President",
  "Organization in New Jersey. **2. The name of the Member Authorizing",
  "Organization in New Jersey. **2. The name of the Manager Authorizing",
  "Organization in New Jersey. **2. The name of the President",
  "Please provide **1. The Record #. as it is on your Articles of",
  "Organization in New Mexico. **2. The name of the Member",
  "Organization in New Mexico. **2. The name of the President",
  "Please provide **1. The SosId Number as it is on your Articles of",
  "Organization in North Carolina. **2. The name of the Member",
  "Organization in North Carolina. **2. The name of the Manager",
  "Organization in North Carolina. **2. The name of the President",
  "Please provide **1. The SOS Control ID# as it is on your Articles of",
  "Organization in North Dakota. **2. The name of the Member",
  "Organization in North Dakota. **2. The name of the President",
  "in Ohio. **2. The name of the Member Authorizing this filing so that we",
  "may file your documents accordingly.",
  "in Ohio. **2. The name of the President Authorizing this filing so that",
  "Organization in Oklahoma. **2. The name of the Member Authorizing",
  "Organization in Oklahoma. **2. The name of the Manager Authorizing",
  "Organization in Oklahoma. **2. The name of the President Authorizing",
  "Please provide **1. The Registry Nbr as it is on your Articles of",
  "Organization in Oregon. **2. The name of the Member Authorizing this",
  "Organization in Oregon. **2. The name of the President Authorizing",
  "Organization in Pennsylvania. **2. The name of the Member",
  "Organization in Pennsylvania. **2. The name of the President",
  "Organization in Rhode Island. **2. The name of the Member",
  "Organization in Rhode Island. **2. The name of the President",
  "Please provide **1. The Business ID. as it is on your Articles of",
  "Organization in South Dakota. **2. The name of the Member",
  "Organization in South Dakota. **2. The name of the President",
  "Please provide **1. The SOS Control Number. as it is on your Articles",
  "of Organization in Tennessee. **2. The name of the Member",
  "of Organization in Tennessee. **2. The name of the Manager",
  "of Organization in Tennessee. **2. The name of the President",
  "Organization in Utah. **2. The name of the Member Authorizing this",
  "Organization in Utah. **2. The name of the Manager Authorizing this",
  "Organization in Utah. **2. The name of the President Authorizing this",
  "Organization in Vermont. **2. The name of the Member Authorizing",
  "Organization in Vermont. **2. The name of the Manager Authorizing",
  "Organization in Vermont. **2. The name of the President Authorizing",
  "Please provide **1. The UBI Number as it is on your Articles of",
  "Organization in Washington. **2. The name of the Member Authorizing",
  "Organization in Washington. **2. The name of the President",
  "Washington DC. **2. The name of the Member Authorizing this filing",
  "so that we may file your documents accordingly.",
  "Washington DC. **2. The name of the Manager Authorizing this filing",
  "Washington DC. **2. The name of the President Authorizing this filing",
  "Please provide **1. The ORG ID as it is on your Articles of Organization",
  "in West Virginia. **2. The name of the Member Authorizing this filing",
  "in West Virginia. **2. The name of the President Authorizing this filing",
  "Organization in Wisconsin. **2. The name of the Member Authorizing",
  "Amend167",
  "Organization in Wisconsin. **2. The name of the President Authorizing",
  "The state of _______ requires The Certificate of Good Standing to be",
  "included with the amendment. The additional Fee to order the",
  "Certificate of Good Standing is $__",
  "Certified",
  "Amendment",
  "Fees to order Certified Amendments",
  "Shares change",
  "__ Amendment Shares",
  "The State of California requires a certified copy of the Amendment",
  "from ______ where we can show the old name and the new name of the",
  "company. The additional Fee to order the certified copy is $_____",
  "The State requires a Certified copy of any amendment, for filing an",
  "amendment for a Foreign Qualification. The additional fee for ordering",
  "Certified Copies from the state of ___ is $.00",
  "The State of Illinois requires a certified copy of the Amendment from",
  "______. The additional Fee to order the certified copy is $_____",
  "The amendment filing fee is based on the authorized shares. For",
  "increasing the shares from _____ to _____ the additional fee required is",
  "$____ Please advise how to proceed.",
  "Trademark, Trade",
  "____ Associated trademarks/trade names",
  "DISSOLUTION",
  "We are unable to dissolve the company through an amendment, you",
  "can place an order here",
  "https://bizee.com/manage-your-company/dissolution. Thank you.",
  "NOT FORMED YET",
  "Your Company is not formed yet, so we have updated our records to",
  "file your company with the new information. Thank you.",
  "Already Updated AR",
  "The amendment is not required as the updates have been processed",
  "in the Annual Report.",
  "The amendment is not required as the information requested is",
  "EIN",
  "The EIN number cannot be added through an amendment. Please",
  "place an order via https://bizee.com/manage-your-company/tax-id-ein",
  "or contact us in case you have any additional questions regarding this",
  "Members not",
  "As per the State of Iowa the Members are not required, so we have",
  "updated our records and your internal documents to reflect the new",
  "information. Thank you.",
  "Please be advised that in order to amend the name, any Trademark,",
  "service mark or trade name associated with the current name must be",
  "also amended. This company currently has a ________, the additional",
  "fee required to continue with the amendment is $_____. Please let us",
  "know how to proceed.",
  "Shares Change",
  "The state will request that we provide them with more in-depth",
  "information about the designations of all your shares. We are unable to",
  "complete their request and do not want to incorrectly complete this",
  "request. Please contact your business advisor regarding the",
  "completion of this amendment to prevent any mistakes. We apologize",
  "for any inconvenience. Thank you.",
  "Members change",
  "Articles of Amendment cannot be filed to add or remove members,",
  "before Annual Report managers, organizers or owners of the limited liability company.",
  "Member and manager information should be set forth in the company's",
  "operating agreement. The operating agreement is not filed with the",
  "Department of Financial Institutions.",
  "Officers/Directors",
  "change before",
  "Per the state, Incorporator information cannot be amended from the",
  "Articles of Incorporation as they are considered original, permanent",
  "documents. Directors or Officers are not listed therefore the",
  "amendment does not apply. We have updated our records and your",
  "internal documents to reflect the changes. Thank you.",
  "NOT LISTED",
  "The Member information is only listed in the Annual Report and can",
  "only be changed in the Next Annual Report. We have updated our",
  "records and your internal documents to reflect the new information.",
  "Incorporators",
  "change",
  "amendment does not apply. You may contact the state at (573) 7514153 for more information. We have updated our records and your",
  "Remove Articles",
  "The Articles of Organization are considered original, permanent",
  "documents and we cannot remove Articles. If you want to remove the",
  "Article V, we suggest to create a new company without this Article and",
  "you can do it trough this link https://www.bizee.com/free-llc . Thank",
  "The Company address is not included in the business registration",
  "therefore it cannot be amended. We have updated our records to",
  "reflect the new information. Thank you.",
  "The Ownership percentages are not included in the business",
  "registration therefore they cannot be amended. We have updated our",
  "The Member information is not included in the business registration",
  "therefore it cannot be amended. We have updated our records and",
  "your internal documents to reflect the new information. Thank you.",
  "The State of Minnesota doesn’t require members, only one Manager is",
  "listed. We have updated our records and your internal documents to",
  "The Shareholder information is not included in the business",
  "registration therefore it cannot be amended. We have updated our",
  "The company address and the member information are not listed in",
  "the business registration therefore they cannot be amended. We have",
  "The NAICS Code is not included in the business registration therefore",
  "it cannot be amended. We have updated our records to reflect the new",
  "The Purpose is not included in the business registration therefore it",
  "cannot be amended. We have updated our records to reflect the new",
  "The Phone number is not included in the business registration",
  "Please be advised that directors/officers/shareholders information is",
  "not listed in the business registration therefore it cannot be amended.",
  "We have updated our records and your internal documents to reflect",
  "the new information.",
  "Please be advised that directors/shareholders information is not",
  "listed in the business registration therefore it cannot be amended. We",
  "have updated our records and your internal documents to reflect the",
  "new information.",
  "Please be advised that officers/shareholders information is not listed",
  "in the business registration therefore it cannot be amended. We have",
  "information.",
  "in the business registration therefore it cannot be amended. Only the",
  "President is listed. We have updated our records and your internal",
  "documents to reflect the new information.",
  "The Shares are not included in the business registration therefore they",
  "The State of Minnesota doesn’t require members, only the Chief",
  "Executive Officer is listed. We have updated our records and your",
  "internal documents to reflect the new information. Thank you.",
  "NOT LISTED BEFORE AR",
  "Per the state, Organizer information cannot be amended from the",
  "Articles of Organization as they are considered original, permanent",
  "documents. Members will be listed in the First Annual Report. We have",
  "updated our records and your internal documents to reflect the",
  "changes. Thank you.",
  "documents. Members are not listed therefore the amendment does",
  "not apply. We have updated our records and your internal documents",
  "to reflect the changes. Thank you.",
  "FQ, FOREIGN",
  "QUALIFICATION",
  "Thank you for your message. You have 3 options when it comes to",
  "moving your LLC from one State to another",
  "1) Domestication- Domesticating your company essentially picks it up",
  "out of the State you are currently incorporated and drops it into the",
  "State you are wanting to move to. Bizee does not file Domestications",
  "so we do not have information on the cost or time needed to process",
  "this kind of filing. We recommend contacting the State Office of the",
  "State you are wanting to move to in order to inquire about this",
  "2) Foreign Qualification- This type of filing would leave your original",
  "corporation where it is but allow your company to be \"Foreign",
  "Qualified\" in another state as well. Do be aware though that you will",
  "have to keep up with the regulations and fees in both states now. You",
  "can see more information, pricing & even file your Foreign Qualification",
  "through Bizee here:",
  "https://www.bizee.com/manage-your-company/foreign-qualification/",
  "You need an active agent per state for the expanding entity.",
  "If you are using our agent, you would need to order a new service for",
  "each new state, which you can do here:",
  "3) Dissolution and Reincorporation- You also have the option of",
  "dissolving your original company and just reincorporating in the new",
  "State.",
  "You can file your Dissolution here:",
  "https://www.bizee.com/manage-your-company/dissolution/",
  "And reincorporate your business here",
  "FORM 2553,",
  "Convertion, SCorp",
  "Please be advised that you can file an S Corp Election through this link",
  "https://www.bizee.com/llc-s-corp-election if you want to convert your",
  "LLC to a Corporation, cannot be processed with an Amendment. The",
  "state requires a different process and Bizee.com does not offer this",
  "service so we do not have information on the cost or time needed to",
  "process this kind of filing. We recommend contacting the State office",
  "of the State you are wanting to make the conversion in order to inquire",
  "about this filing.",
  "FORM 2553, SCorp,",
  "Revokation",
  "Form 2553 is not part of the Articles of Organization and cannot be",
  "amended. Please contact the IRS to receive information on Revoking",
  "the S Corp election",
  "https://www.irs.gov/forms-pubs/revoking-a-subchapter-selection#:~:text=To%20revoke%20a%20Subchapter%20S,made%20un",
  "der%20Section%201362(a)",
  "DBA",
  "The DBA (Doing Business As) or Fictitious name cannot be added",
  "through an amendment. Please place an order via",
  "https://www.bizee.com/fictitious-business-or-trade-name. Thank you.",
  "DBA, Transfer",
  "Please be advised that we do not file amendments for DBA and we are",
  "unable to transfer a DBA from one company to another. You will have to",
  "file another assumed business name under the correct company.",
  "Conversion",
  "Bizee does not file Entity Conversions. We recommend contacting the",
  "State Office of the State you want to make the conversion to inquire",
  "We can not change the EIN information, you may contact the IRS 1800-829-4933, any updates may only be done by the members of the",
  "Could you ask about the share fees for this order?",
  "They have ____ at a $___ par value and want to change to _____ shares",
  "of common stock, a $____ par value.",
  "Biennial Statement",
  "Amendment for a",
  "Business",
  "Corporation",
  "RE: ____________",
  "Please provide the Biennial Statement Amendment form for the above",
  "entity.",
  "Thank you,",
  "Best regards",
  "Email to the State",
  "Please Review and Update as Requested",
  "Name of entity: _______",
  "ID#: _______",
  "Thank You,",
  "Best regards.",
  "Please file this amendment EXPEDITE.",
  "File Number: _______",
  "Please sign - _______",
  "Check for $60",
  "Directors Request",
  "Please be advised the state only lists Directors. Please advise if you",
  "would like to add _______ as Director of the Company.",
  "Unclear Amendment",
  "Information",
  "Please clarify the information you would like to amend.",
  "Missing Amendment",
  "Please be advised, we didn’t get all the amendment details. Please",
  "provide all the information you would like to amend.",
  "Par Value Missing",
  "Please provide the Par Value for the new ____ shares.",
  "amount of the shares to be a whole number. The value requested is",
  "requested is Shares ____ * Par Value $______ = $_____. Please decrease",
  "NFP Statement",
  "The state of Arkansas requires a brief statement regarding the",
  "Approval of the Amendment.",
  "Circle I, II, or III below, whichever is applicable, and attach appropriate",
  "statement.",
  "**I. If approval of members was not required, a statement to that effect",
  "and a statement that the amendment was approved by a sufficient",
  "vote of the board of directors or incorporators;",
  "**II. If approval by members was required: (a) the designation, number",
  "of memberships outstanding, number of votes entitled to be cast by",
  "each class entitled to vote separately on the amendment, and the",
  "number of votes of each class indisputably voting on the amendment;",
  "and (b) either the total number of votes cast for and against the",
  "amendment by each class entitled to vote separately on the",
  "amendment or the total number of undisputed votes cast for the",
  "amendment by each class and a statement that the number cast for",
  "the amendment by each class was sufficient for approval by that class.",
  "**III. If approval of the amendment by some person or persons other",
  "than the members, the board or incorporators is required pursuant to §",
  "4-33-1030, a statement that the approval was obtained.",
  "registration therefore it cannot be amended. You may provide the",
  "information so that we can update our records and your internal",
  "documents to reflect the new information. Thank you",
  "therefore it cannot be amended. You may provide the information so",
  "that we can update our records and your internal documents to reflect",
  "Please confirm that _____ is the Member authorizing this filing",
  "Show 13 more",
  "Please provide the name of the Member authorizing this filing",
  "that we can update our records to reflect the new information. Thank",
  "County Change",
  "Please be advised that the company address is not listed on the",
  "business registration therefore it cannot be amended. If you would like",
  "to change the county _____ in which your business operates for",
  "publication purposes, please provide the new county and we can",
  "proceed with the change. If the changes do not apply then we can",
  "cancel and refund your order. Thank you.",
  "Incorrect County",
  "Please be advised that _______ is not a county in New York, this is the",
  "list of the New York Counties",
  "http://www.p12.nysed.gov/repcrd2005/links/nycounty.shtml Please",
  "provide the correct County so we can proceed.",
  "to change the county _____, in which your business operates for",
  "publication purposes, to ______, which is the new address county",
  "please advise and we can proceed with the change. If the changes do",
  "not apply then we can cancel and refund your order.",
  "You may provide the information so that we can update our records",
  "and your internal documents to reflect the new information.",
  "listed. You may provide the name and address of the new member so",
  "we can update our records and your internal documents to reflect the",
  "President is listed. You may provide the information so we can proceed",
  "with the amendment.",
  "RA Expired",
  "The Registered Agent Service is expired, please renew the service or",
  "change the Agent",
  "https://bizee.com/manage-your-company/change-of-registered-agent.",
  "RA Staged for",
  "Resignation",
  "The Registered Agent is Staged for Resignation, please renew the",
  "service or change the Agent",
  "Same company as",
  "RA",
  "A business is not able to name itself as its own agent, please provide",
  "the new Registered Agent information.",
  "Officers Titles",
  "Request",
  "Please be advised the state only lists Officers (President, Secretary,",
  "Treasurer, Vice President). Please advise if you would like to add",
  "_______ as one of the above listed Titles.",
  "Address LLC",
  "Please advise if the new address will apply to 1. Principal, 2. Mailing, 3.",
  "Registered Agent, 4. Member’s address or all the above.",
  "Change of Agent",
  "Change RA",
  "Please be advised that in order to Change your Registered Agent you",
  "need to place a Change of Agent order due to the required documents",
  "and fees with the state and you can do it in this link",
  "https://www.bizee.com/manage-your-company/change-of-registeredagent",
  "Address CORP",
  "Registered Agent, 4. Director’s, 5. Officer’s address or all the above.",
  "VA Service",
  "Cancelled",
  "The Virtual address subscription is cancelled. Please renew the",
  "subscription or provide a new address.",
  "PO BOX PMB",
  "Remove designator",
  "for a Fictitious name or DBA, https://bizee.com/file-dba and we can",
  "cancel and refund this order.",
  "for LLC",
  "Please be advised the state regulation does not allow a Limited Liability",
  "Company to have two designators. Also “CORP.” is a designator for",
  "corporations and non-profits and is not allowed in an LLC name. Advise",
  "if you would like to continue with a company name change to _________",
  "if not, provide a new name. Thank you",
  "for CORP",
  "Please be advised the state regulation does not allow a Corporation to",
  "have two designators “COMPANY”. Advise if you would like to continue",
  "with a company name change to _________ if not, provide a new name.",
  "Purpose Change",
  "Please be advised that the Purpose of your company is “To engage in",
  "any lawful act or activity for which a corporation may be organized",
  "under the Business Corporation Law, provided that it is not formed to",
  "engage in any act or activity requiring the consent or approval of any",
  "state official, department, board, agency, or other body without such",
  "consent or approval first being obtained.” and we may not be changing",
  "the Purpose, please let us know how to proceed, or we can cancel and",
  "refund your order if no changes apply.",
  "Purpose Change LLC Please be advised that the Purpose of your company is “To engage in",
  "any lawful act or activity within the purposes for which limited liability",
  "companies may be organized pursuant to Limited Liability Company",
  "Law provided that the limited liability company is not formed to engage",
  "in any act or activity requiring the consent or approval of any state",
  "official, department, board, agency, or other body without such",
  "in the business registration therefore it cannot be amended. You may",
  "provide the information so that we can update our records and your",
  "internal documents to reflect the new information. Thank you",
  "listed in the business registration therefore it cannot be amended. You",
  "may provide the information so that we can update our records and",
  "your internal documents to reflect the new information.",
  "The amendment is not required as the company is already in ________",
  "County.",
  "Address Change",
  "Please be advised that we can only change 1. Service of Process, 2.",
  "CEO, 3. Principal Executive Office and 4. Registered Agent Address,",
  "advise if you would like to change any of these.",
  "NAICS Code Change",
  "Please be advised the State of Alaska uses the 2022 Federal U.S.",
  "Census Bureau NAICS Codes version, and the NAICS CODE provided",
  "“_____” corresponds to an older version. We will need the most",
  "accurate NAICS Code. Please confirm that we can use the NAICS Code",
  "“_____” as it is the update of the NAICS Code provided. If you would",
  "like, we can provide to you the new list of NAICS Codes so you can",
  "choose the most accurate for your company.",
  "CORP Signature",
  "Please be advised that in order to proceed with the amendment, two",
  "signatures are necessary: one to acknowledge the corporate act and to",
  "verify the facts under the penalties for perjury, and one to witness or",
  "attest the signature. The signatures must be by different individuals.",
  "Please provide the name and the title of both persons signing the Form",
  "(President, Secretary, Treasurer or Vice President if possible)",
  "BOIR",
  "The Beneficial Ownership Information Report (BOIR) cannot be",
  "amended, you can file an updated BOIR no later than 30 days after the",
  "date on which the changes occurred. We can help with the filing of the",
  "updated BOIR, you can place an order once the amendment has been",
  "completed https://bizee.com/services/boir-filing",
  "VA, Amendment",
  "Please be advised that the state is not accepting any Virtual Addresses",
  "to be used as the principal business address and/or member address",
  "of a company therefore we cannot proceed with the amendment. If",
  "you wish to keep the Virtual Address you can use it for private mail",
  "purposes. Please let us know how to proceed. If any changes apply, we",
  "may cancel and refund your order. Thank you.",
  "of a company therefore we cannot proceed with the order. If you only",
  "want the virtual address without the address change amendment",
  "please let us know so that we can refund the amendment portion and",
  "only honor the virtual address part of the order. Thank you.",
  "Add Directors",
  "Please be advised the director’s information is currently not listed in",
  "the articles. The Articles of Incorporation are considered original,",
  "permanent documents. We can Amend the articles but cannot delete",
  "Articles after adding them. If would want to add the information,",
  "provide the names and addresses of all directors.",
  "FQ Amendment",
  "Please be advised that in order to change the name on a Foreign Entity,",
  "the company name must be changed first in the domestic entity (____),",
  "we can help with the amendment in the Domestic State, you can place",
  "an order from your dashboard here",
  "https://bizee.com/form/manage-your-company/amendment or you can",
  "file the amendment by yourself. Let us know how to proceed. Thank",
  "No Effective Date",
  "Please be advised that the state does not accept any effective date for",
  "__________. The state files the changes based on when they receive the",
  "document and their workload. We can submit the changes now or wait",
  "till Dec 31. Please advise how to proceed,",
  "Access Request",
  "Please be advised that we have requested an access code for the",
  "State, for the purpose of making changes to your company. Please",
  "provide us with your access code issued or please contact the state at",
  "(701) 328-4284 for the code. We will need the code issued so that we",
  "may proceed. Thank you.",
  "Change",
  "USPS shows that your correct ZIp Code is \"______\" Please verify it, and",
  "Address change",
  "Please confirm if the new address will apply to the Member’s address.",
  "Be advised that the entity Address on display in the Texas records is",
  "the taxpayer address on file with the Comptroller. This address can",
  "only be changed through the Comptroller's office. The Initial Mailing",
  "Address may not be amended. Any changes to this address must be",
  "made through the Comptroller's office. Please see",
  "https://comptroller.texas.gov/web-forms/franchise/changeaddress/",
  "Address change - RA Please provide the new address and confirm if it will apply to the",
  "and Member",
  "Registered Agent and Member’s address. Please consider the",
  "applicable",
  "Registered Agent must have a physical in-state address. (Be advised",
  "that the entity Address on display in the Texas records is the taxpayer",
  "address on file with the Comptroller. This address can only be changed",
  "through the Comptroller's office. The Initial Mailing Address may not be",
  "amended. Any changes to this address must be made through the",
  "Comptroller's office. Please see",
  "www.window.state.tx.ux/franchise/changeaddress.html.)",
  "Entity as RA",
  "REQUEST OF",
  "ARTICLES",
  "______________________, we require these to complete the Amendment.",
  "Please provide your Articles of Organization/Incorporation so that we",
  "may amend your documents accordingly.",
  "Add Members",
  "Please be advised the member’s information is currently not listed in",
  "the articles. The Articles of Organization are considered original,",
  "provide the names and addresses of all members.",
  "Please provide the name of the Manager of the member company",
  "___________ as required by the state of Illinois.",
  "Request of Annual",
  "Please provide the a copy of the last Franchise Tax Report (2023) filed",
  "with the state. We require this to complete the Amendment.",
  "Member informartion Please provide 1. The names, 2. addresses, and 3. ownership",
  "percentages of the new members.",
  "Directors/Officers",
  "Titles Request",
  "Please be advised the state only lists Directors and Officers",
  "(President, Secretary, Treasurer, Vice President). Please advise if you",
  "would like to add _______ as one of the above listed Titles.",
  "Directors/President",
  "Please be advised the state only lists Directors and President Please",
  "advise if you would like to add _______ as Director and/or President of",
  "the Company.",
  "Treasurer). Please advise if you would like to add _______ as one of the",
  "above listed Titles.",
  "(President, Secretary). Please advise if you would like to add _______",
  "as one of the above listed Titles.",
  "MANAGER’S",
  "ADDRESS",
  "Please provide the address for the new manager _________.",
  "Manager structure",
  "Please be advised that the Members Structure applies for all the",
  "Members/Managers and it can not apply for only one of them. Please",
  "advise how to proceed.",
  "MEMBER’S ADDRESS Please provide the address for the new member _________.",
  "Virtual Address VA",
  "Please advise if you would like the virtual address to apply to the 1.",
  "Principal, 2. Mailing, 3. Member’s address or all the above.",
  "NAICS",
  "Code/PURPOSE",
  "it cannot be amended. If you want to change your Purpose, please",
  "provide a new Purpose.",
  "cannot be amended. If you want to change your NAICS Code, please",
  "provide a new NAICS Code https://www.naics.com/search/",
  "Please be advised 1. The State does not allow P.O. Box, PMB, Shipping",
  "Centers, or UPS Stores as the Company address. 2. Advise if the new",
  "address will only apply for Mailing and _______.",
  "CONFIRM",
  "MEMBER/OFFICER/D",
  "IRECTOR NAME",
  "Please be advised that we have to clarify some information before we",
  "proceed with this order. We need to clarify if _________ is the same",
  "person as __________ which is the person listed on the company.",
  "Please advise if the virtual address will apply to 1. Principal, 2. Mailing,",
  "3. Director’s, 4. Officer’s address or all the above.",
  "Offer VA Service",
  "If you want to use our Virtual Address Service, you may subscribe",
  "through this link, https://bizee.com/form/virtual-mailbox.",
  "Offer RA Service",
  "If you want to subscribe to our Registered Agent Service, you may",
  "place an order through this link",
  "Remove",
  "Please advise if ______ remain as a member with 0% ownership or will",
  "be removed from the organization.",
  "Contact is not a",
  "proceed with this order. Please provide a letter from __________, the",
  "current owner of the company “_______________________” has",
  "transferred ownership to ___________________. Due to the removal of the",
  "current members of the company we need to verify which current",
  "member is authorizing this amendment filing.",
  "*****. Please provide the correct _______ ID in _____.",
  "Minimum 3 Directors",
  "The state of Alaska mandates: Non-profit corporations must have a",
  "president, vice president, secretary, treasurer and at least three",
  "directors. Please provide the name and address of all directors.",
  "A recent legislative change in Illinois now prohibits the use of virtual",
  "and members' address' are using our virtual location. To comply with",
  "the new regulation, we kindly request a new physical address for both",
  "your company and members. You can still utilize the virtual address for",
  "private mail purposes. If this virtual address was used to obtain an EIN,",
  "and you wish to cancel the service, it's essential to notify the IRS.",
  "Please provide the new physical address at your earliest convenience.",
  "Additionally, let us know if you want to cancel the Virtual Address",
  "Cancelled LLC",
  "Please provide 1. The principal company address, 2. Mailing Address, 3.",
  "Member’s address, as the Virtual address subscription is cancelled.",
  "Cancelled CORP",
  "Director’s address, 4. Officer’s address as the Virtual address",
  "subscription is cancelled.",
  "Please be advised that the company name __________ is not available in",
  "the State, provide 3 alternative names.",
  "Name change as",
  "Correction",
  "Please be advised as this is a name correction and not an amendment.",
  "The state only accepts paper filing, which can take upto 4 weeks.",
  "Please advise if this is acceptable.",
  "Name Change Paper",
  "Please be advised we can not proceed with this amendment via online,",
  "as the new name is very similar to the actual name and this makes a",
  "conflict. The state will only accept this new name as a paper filing,",
  "which can take up to 4 weeks. Please advise if you would like to",
  "continue with the paper filing or send us another name to proceed via",
  "online. Thank you.",
  "Approval of the",
  "Amendment - NPF",
  "Approval of the Amendment. Circle I, II, or III below, whichever is",
  "applicable, and attach appropriate statement. I. If approval of members",
  "was not required, a statement to that effect and a statement that the",
  "amendment was approved by a sufficient vote of the board of directors",
  "or incorporators; II. If approval by members was required: (a) the",
  "designation, number of memberships outstanding, number of votes",
  "entitled to be cast by each class entitled to vote separately on the",
  "amendment, and the number of votes of each class indisputably voting",
  "on the amendment; and (b) either the total number of votes cast for",
  "and against the amendment by each class entitled to vote separately",
  "on the amendment or the total number of undisputed votes cast for the",
  "III. If approval of the amendment by some person or persons other than",
  "the members, the board or incorporators is required pursuant to § 433-1030, a statement that the approval was obtained. Please provide",
  "the appropriate statement form signed by the officers, so we can",
  "proceed with the filing. The same email has been sent to you via",
  "mfile@incfile.com so you can attach the Document.",
  "Members Structure",
  "Please be advised that your Members Structure on California is ______.",
  "Advise if you would like to change for:",
  "A) One Manager",
  "B) More than One Manager",
  "C) All LLC Member(s)",
  "Different Member’s",
  "name in State",
  "Please be advised that the current member in the state is _______.",
  "Advise if would you like change the name to ___________.",
  "Show 16 more",
  "Please be advised that the State of Maryland doesn't allow an entity",
  "as a member. Please provide an individual information or we can",
  "cancel and refund your order. Please advise how to proceed.",
  "a member. Please provide an individual information or we can cancel",
  "and refund your order. Please advise how to proceed.",
  "Please be advised that the state has implemented a new system that",
  "requires access to be given for the purpose of making changes to your",
  "company’s registration/information. We have placed a request that",
  "access is given through the state and you will have to grant us the",
  "access in order to process this order. You may contact the state at",
  "(916) 657-5448 for more information. Please email us the Access code",
  "so we may proceed with the Amendment.",
  "Missing Purpose",
  "Please provide the Purpose for your company, advise that the State of",
  "California only allows 100 characters as the company purpose.",
  "Please provide the Purpose for your company.",
  "Please be advise that in order to change the Officers and Directors of",
  "the Corporation, a copy of the board resolution or similar document in",
  "which the new officer(s) are appointed is required. Please provide us",
  "with the document so we can proceed",
  "Verify the spelling of the new company name \"_________\"",
  "Companies as a",
  "manager.",
  "Please be advised that the state of Rhode Island doesn’t allow",
  "Companies as a manager. Please advise how to proceed.",
  "Member's name",
  "structure",
  "Please confirm the member's name structure, First Name: _______, Last",
  "Name: _______.",
  "Annual 84",
  "change CORP",
  "The Company address is not included in the business registration, you",
  "can have more information about changing the principal address here",
  "https://scbos.sc.gov/SiteAssets/PDF/SCBOS/Resources/Change-YourBusiness-Address.pdf",
  ". Thank you.",
  "1 Year Outstanding",
  "302 Filing Fee for 2024 Annual Report",
  "The Annual Report for 2024 is outstanding, failure to file can result in",
  "Administrative Dissolution. The Additional Funds required to file the",
  "Reports is $302.00. Please advise how you would like to proceed.",
  "FQ Report Fee",
  "285 FOREIGN FILING FEE",
  "The state fee for filing an Annual Report for a Foreign Entity is",
  "$435.00. The additional funds required to submit the filing is $285.00.",
  "Please advise how you would like to proceed.",
  "2 Years Outstanding",
  "604 Filing Fee for 2023-2024 Annual Report",
  "The Annual Report for 2023 and 2024 are outstanding, failure to file",
  "can result in Administrative Dissolution. The Additional Funds required",
  "to file the Reports is $604.00. Please advise how you would like to",
  "PLLC fee is different",
  "50 PLLC FILING FEE",
  "Please be advised the Annual Report Fee for a Professional LLC is",
  "$75.00. The additional funds required to file the reports is $50.00.",
  "100 FOREIGN FILING FEE",
  "The state fee to file the 2024 Biennial report for a Foreign corporation",
  "is $200.00. The additional funds required to complete the filing is",
  "$100.00. Please advise how you would like to proceed.",
  "1 FT Owned LLC",
  "The 2025 Franchise tax Report was due by 06/01/2025, failure to file",
  "can result in administrative dissolution. The state assesses a $200.00",
  "penalty and 1.5% interest per month on tax and penalty. Additional",
  "Funds of $______ (Fees and penalty) are required so we can complete",
  "the filing.***FILING DEADLINE 06/01/2024***",
  "Late Fee",
  "38 LATE FILING FEE",
  "The Company Status: Non-Compliant in the State of Alaska for failure",
  "to file the 2024 biennial report - Due date was ______. The state has",
  "applied a late fee $38.00. The Additional Funds required to file biennial",
  "report is $38.00.",
  "Initial Report",
  "Outstanding",
  "149 INITIAL REPORT OUTSTANDING",
  "Please be advised we are unable to file the 2025 Annual Report as",
  "the Initial Registration for 2024 is due. The state requires you to",
  "complete both filings the Initial Registration and the 2025 Annual",
  "report. The additional Fee to file the 2024 Initial Registration is",
  "$149.00",
  "PIR Outstanding",
  "99 PUBLIC INFORMATION REPORT OUTSTANDING",
  "Please be advised we are unable to file the 2025 Public Information",
  "Report as the 2024 is past due. The state requires you to complete",
  "both filings the 2024 and the 2025 reports. The additional Fee to file",
  "the 2024 Report is $99.00",
  "Foreing entity FEE is",
  "different",
  "___ FOREIGN FILING FEE",
  "Fee is based on the",
  "shares",
  "210 FILING FEE BASED ON SHARES",
  "Late fee",
  "210 LATE FEE",
  "Please be advised the State fee to file the Annual Report for a Foreign",
  "Entity is $___.00. The additional fees required to file the Report is",
  "Annual registration fee is based on the number of shares the",
  "corporation is authorized to issue according to the records. Authorized",
  "shares - 35,001 – 40,000 - Fee $310. Additional Fee required to file the",
  "report $210",
  "The Annual Report was due on ________ .The state has applied a Late",
  "filing penalty Fee _______ Additional Fee required to file the report $210",
  "Late Fee + Past AR",
  "189 2023 ANNUAL REPORT FEE",
  "The 2023 Annual Report filing was due by _____. Late filing fees and",
  "penalties assessed by the state are $90.00 (Report Fee and Late Fee)",
  "and bizee fee is $99.00. The Additional funds required to complete the",
  "filing is $189.00. We are unable to file the 2024 Annual Report till the",
  "2023 Report is completed.",
  "45 LATE FILING FEE",
  "The 2023 Annual Report filing was due by ______. The Additional funds",
  "required to complete the filing is $45.00.",
  "___ LATE FILING FEE",
  "The company status: Not in compliance in the State of West Virginia",
  "for failure to file the ___ annual report. The state has applied a late fee",
  "$__.00. The Additional Funds required to file biennial report is $___",
  "30 LATE FILING FEE",
  "The 2024 Corporation Franchise Tax Report due date is 05/01/2024.",
  "The state has assessed a late fee penalty and interest of $30.00.",
  "400 LATE FILING FEE",
  "The 2025 Annual Report was due by 05/01/2025. The State has a late",
  "fee $400.00 for filing the Annual Report after the deadline.",
  "25 LATE FILING FEE",
  "The 2025 Annual Report was due by 04/01/2025. The State has a late",
  "fee $25.00 for filing the Annual Report after the deadline.",
  "103 LATE FILING FEE",
  "The Company Status: Not In Good Standing - _____ for failure to file the",
  "Annual Report, failure to file can result in administrative dissolution. The",
  "state adds a penalty of $100 if the annual report is not filed within 60",
  "days after the due date. The state penalty for late filing - $103",
  "Past AR NFP",
  "109 2022 Annual Report Fee",
  "The 2022 Annual Report filing was due by _________. The Additional",
  "funds required to complete the filing is $109.00.",
  "1 year outstanding",
  "200 1 YEAR OUTSTANDING FEE",
  "The Annual Reports are past due for 2023. We cannot file the 2024",
  "until the outstanding reports are filed. The additional fees required to",
  "file the reports is $200.00.",
  "2 years outstanding",
  "200 2 YEARS OUTSTANDING FEE",
  "The company status is Delinquent for failure to file the 2022 & 2023",
  "Annual Report. The Additional funds required to file is $200.00. We are",
  "unable to file the report for 2024 till the outstanding Reports are filed.",
  "Inactive Status NFP",
  "00 REVOKED STATUS",
  "The Company Status: Revoked - for failure to file the ___ Annual report",
  "on time in State of Arkansas. The state fee and penalty required to file",
  "the outstanding Annual report for _____ is $____ Additional funds",
  "required to file the Reinstatement to restore the company’s Good",
  "Standing status in Arkansas is $____",
  "Inactive Status LLC,",
  "ENTITY FORMED",
  "CURRENT YEAR",
  "The Annual Report is not required. This business entity was formed or",
  "incorporated this calendar year.",
  "The Company Status: Revoked - for failure to file the ___ Franchise Tax",
  "report on time in State of Arkansas. The state fee and penalty required",
  "to file the outstanding franchise Tax report for _____ is $____ Additional",
  "funds required to file the Reinstatement to restore the company’s Good",
  "The Biennial Report is not required. This business entity was formed or",
  "We don’t File AR",
  "Please be advised that we are canceling and refunding your order. We",
  "do not offer Annual Report fling service in this state.",
  "Initial Report already",
  "Filed LLC",
  "The Initial report has already been filed. The next Biennial Report is",
  "due by __________",
  "Window not Open",
  "The Biennial Report is not required for the current year. Next Biennial",
  "report is due _____",
  "Biennial Report",
  "already filed",
  "The Annual Report is not required for the current year. Next Annual",
  "PIR already filed",
  "The Public Information Report is not required for the current year.",
  "Next Report is due _____",
  "filed CORP",
  "The Initial report has already been filed. The next Annual Report is",
  "due by _________.",
  "already filed CORP",
  "Annual report has already been filed. The next Annual Report is due",
  "by ________.",
  "already filed LLC",
  "Biennial report has already been filed. The next Biennial Report is due",
  "filed",
  "already Filed",
  "Annual Report has already been filed for the current filing year.",
  "Total Revenue above",
  "$2,470,000",
  "We are unable to file the Report as the Total Revenue reported for the",
  "year 2023 is above the “No Tax Due Threshold $2,470,000”. Thank",
  "OK to Partial Refund",
  "OK to refund $___.00, initial report has no fee",
  "Recalculate the total",
  "Franchise Tax Fee",
  "The state recommends using the Assumed Par Value Capital Method,",
  "for companies with a high number of shares to assess the taxes owed.",
  "Please provide the following SPECIFIC information so we can calculate",
  "a lower Franchise Tax and process the filing.",
  "1. Total Issued Shares (Issued shares are the subset of authorized",
  "shares that can be held by the company, held by employees, or held by",
  "the general public.) 2. Gross Assets as of 12/31/2024 (as reported on the U.S. Form 1120,",
  "Schedule L.)",
  "Please consult your business accountant or CPA for clarification of this",
  "information as we do not provide this type of assistance. Return this",
  "information in a timely manner to prevent any filing delays, additional",
  "fees and/or order refund/cancellation.",
  "Partial Refund",
  "Initial Report no Fee",
  "Please be advised that we are refunding $___.00 There is no state fee",
  "for the initial report",
  "RI filed with AR,",
  "***ONLY IF WE",
  "HAVE $638 ON THE",
  "AR ORDER",
  "200",
  "VA Company",
  "The Company Principal Address must be a physical deliverable address",
  "and cannot be a PMB, PO Box, UPS, FEDEX, STAPLES, postal, shipping",
  "or mailing center, VIRTUAL OFFICE ADDRESS. Please send us a",
  "physical address for your company so we can continue with the filing.",
  "Please provide a physical street address. The street address cannot be",
  "a PO Box or PMB (personal/private mailbox).",
  "_______________ State site with the name provided. Please provide the",
  "entity number and the company name exactly as registered in the state",
  "so that we may proceed.",
  "The company status: administratively dissolved for failure to file an",
  "annual report Event Date Filed 09/27/2024. The reinstatement was",
  "filed to restore the company status to Good Standing. Reinstatement",
  "Fee is $438 - Refund $200 credit balance to card on file.",
  "Please be advised that we are unable to locate your company on the",
  "_________ state site with the name provided, __________. Please provide",
  "the entity number and the company name exactly as registered in the",
  "state so that we may proceed. If the company was registered in a",
  "different state, please advise so that we may cancel and refund this",
  "Before you Start",
  "Please provide the number of West Virginia resident Employees as",
  "required by the state. Thank you",
  "NFP Details",
  "Please provide the following details as required by the state.",
  "1. Is this entity registered with the IRS as an exempt organization?",
  "2. If yes, what type of exemption status is held?",
  "FQ CORP",
  "Please provide the following information as required by the state :",
  "Estimated value of all real or personal property of the corporation.",
  "Missing Officers",
  "No Member",
  "Percentage provided",
  "2 FT Owned LLC",
  "_____ & ____ Franchise tax Report are outstanding, failure to file may",
  "result in administrative dissolution. The state assesses a $200.00",
  "penalty and 1.5% interest per month on tax and penalty for each year.",
  "State fees of $_____ (Fees and penalty) are required so we can",
  "complete the filing for 20__-20__. Failure to file can result in",
  "administrative dissolution. Please email us for the Payment",
  "Authorization form for the State fee. The state fee will be charged",
  "directly to that credit card. The Incfile fee $199.00, will be deducted",
  "from the fees you paid on the order and the difference $_____, will be",
  "refunded to the credit card on file.",
  "Webfile number",
  "The Webfile number _________ is invalid. The state provides different",
  "Webfile number for Sales Tax and Franchise Tax. The Webfile number",
  "is issued by the Comptroller's office. It is printed in the upper left",
  "corner of the tax report mailed to each taxpayer. It is two letters",
  "followed by six numbers (Example: XT666666). If you do not have your",
  "Webfile number, you can contact (800) 442-3453 24 hours a day, 7",
  "days a week.",
  "SOS Suspended for",
  "No Agent",
  "The company current Status: SOS Suspended - Agent Resignation The state mandates the company have a Valid Registered agent.",
  "Please select one of the following:",
  "A) Subscribe/Renew REPUBLIC REGISTERED AGENT INC.",
  "B) Please provide the new agent Name And Address. We can update",
  "the Registered Agent information with the Report we are filing.",
  "Please provide the Purpose for your company, be advised that the",
  "purpose.",
  "Total Revenue",
  "Please provide the Total Revenue from Jan 01 - Dec 31 for 2024.",
  "Member as Entity",
  "missing designator",
  "Please provide the Member’s company name Exactly as registered in",
  "the state with the designator. Thank you.",
  "Please provide the EIN number for your company, if you don't have it,",
  "you can place an order via",
  "EIN/FEIN doesn’t",
  "match State records",
  "The state requires a 2 step verification .. The state ID and the FEIN ..",
  "when we attempt to file the report with the FEIN in our records we get",
  "an error message. ***Filing Number exists, but does not match Federal",
  "ID. *** Please contact the Business and Commercial Services Division",
  "at (501) 682-3409, and request a reset of the Federal Id to all Zero’s so",
  "we can access and apply the correct FEIN. Please email us with the",
  "update so we can complete the filing.",
  "same as RA address",
  "Please be advised that a recent legislative change in Delaware, now",
  "prohibits the company address to be the same as the physical",
  "address of its Registered Agent. Please provide a new company",
  "address different from your Registered Agent’s address.",
  "Reinsta 41",
  "3 Years",
  "The state requires specific details to calculate the total Franchise Tax",
  "The Company Status: Inactive - Administratively Dissolved (Tax)",
  "Fee. We have sent you an email directly from mfile@incfile.com",
  "_____, for failure to file the Annual Report in the State of Wyoming. We",
  "requesting the information required to process the filing. Please consult",
  "can file a Reinstatement and the Outstanding Annual Reports (20__",
  "your business accountant or CPA for clarification of this information as",
  "20 ) The Reinstatement fee is $587 00 The Additional Fee required"
]
